[
    {
        "Abstract": "Leveraging Clustering Techniques for Enhanced\nDrone Monitoring and Position Estimation\nAbstract\nDrone tracking and localization are essential for various applications, including\nmanaging drone formations and implementing anti-drone strategies.",
        "Methodology": "This involves extracting faint signals from varied flight settings and maintaining\nalignment despite swift actions. Typically, cameras and LiDAR systems are used\nto record the paths of drones. However, they encounter challenges in categorizing\ndrones and estimating their positions accurately. It uses a clustering-based learning detection strategy\nto track and estimate the position of drones using data from two types of LiDAR\nsensors: Livox Avia and LiDAR 360. This method merges data from both LiDAR\nsources to accurately determine the drone’s location in three dimensions. The\nmethod begins by synchronizing the time codes of the data from the two sensors\nand then isolates the point cloud data for the objects of interest (OOIs) from the\nenvironmental data. A Density-Based Spatial Clustering of Applications with\nNoise (DBSCAN) method is applied to cluster the OOI point cloud data, and the\ncenter point of the most prominent cluster is taken as the drone’s location. Present anti-UA V methods\npredominantly utilize visual, radar, and radio frequency (RF) technologies. Despite these strides,\nrecognizing drones poses a considerable hurdle for sensors like cameras, particularly when drones\nare at significant altitudes or in challenging visual environments. These methods usually fail to spot\nsmall drones because of their minimal size, which leads to a decreased radar cross-section and a\nless noticeable visual presence. Furthermore, current anti-UA V studies primarily focus on detecting\nobjects and tracking them in two dimensions, overlooking the crucial element of estimating their\n3D paths. Our proposed solution, a detection method based on clustering learning (CL-Det), uses the strengths\nof both Livox Avia and LiDAR 360 to improve the tracking and position estimation of UA Vs. Initially, the timestamps from the Livox Avia and LiDAR 360 data are aligned to maintain temporal\nconsistency. By examining the LiDAR data, which contains the spatial coordinates of objects at\nspecific times, and comparing these to the actual recorded positions of the drone at those times, the\ndrone’s location within the LiDAR point cloud data is effectively pinpointed. The point cloud of the OOIs\nis grouped using the DBSCAN algorithm, and the central point of the largest cluster is designated as\nthe UA V’s position. To mitigate potential data deficiencies, past estimations are employed to supplement missing data,\nthereby maintaining the consistency and precision of UA V tracking. 2 Methodology\nThis section details the methodology employed to ascertain the drone’s spatial position utilizing\ninformation from LiDAR 360 and Livox Avia sensors. The strategy integrates data from both sensor\ntypes to achieve precise position calculations. The procedure\ngives precedence to LiDAR 360 data, using Livox Avia data as a backup if the former is not available. If neither source is accessible, the position is estimated using historical averages. 2.2.1 LiDAR 360 Data Processing\n•Separation of Points: The LiDAR 360 data is visually examined to classify areas into two\nzones: environment and non-environment zones. •Removal of Environment Points: All points within the environment zone are deemed part\nof the surroundings and are thus excluded from the dataset. •Clustering: The DBSCAN clustering algorithm is applied to the remaining points to discern\ndistinct clusters. •Cluster Selection: The most extensive non-environment cluster is chosen as the representa-\ntive group of points that correspond to the drone. •Mean Position Calculation: The mean of the residual points is computed to ascertain the\ndrone’s position in (x, y, z) coordinates. 22.2.3 Fallback Method\nWhen neither LiDAR 360 nor Livox Avia data is available, the average location of the drone derived\nfrom training datasets is used. The average ground truth position (x, y, z) from all training datasets\nestimates the drone ground truth position, which is (0.734, -9.739, 33.353). 2.3 Implementation Details\nThe program fetches LiDAR 360 or Livox Avia data from the nearest timestamp for each sequence,\nas indicated in the test dataset. Visual inspection is employed for the preliminary\nseparation of points, ensuring an accurate categorization of environment points. The analysis was carried out in a\nJupyter Notebook environment using Python 3.10. For clustering, the DBSCAN algorithm from the\nScikit-Learn library was utilized. The approach guarantees dependable and precise drone position estimation by utilizing\nmulti-sensor data and robust clustering methods. Fallback mechanisms are in place to ensure con-\ntinuous position estimation even when primary sensor data is absent.",
        "Results and Findings": "Recent years have witnessed a surge in research on anti-UA V systems. Two primary sensor types are employed: LiDAR 360\nand Livox Avia, both of which supply 3D point cloud data crucial for identifying the drone’s location. The detailed data descriptions are outlined as follows:\n•LiDAR 360 offers a complete 360-degree view with 3D point cloud data. •Livox Avia delivers focused 3D point cloud data at specific timestamps, typically indicating\nthe origin point or the drone’s position. After removing environment\npoints, it is observed that the remaining non-environment points imply the drone position. Clustering is executed using the DBSCAN algorithm with appro-\npriate parameters to guarantee strong clustering. The implementation was conducted on a Lenovo IdeaPad Slim 5 Pro (16\") running Windows 11\nwith an AMD Ryzen 7 5800H CPU and 16GB DDR4 RAM. 3 Results\nThe algorithm achieved a pose MSE loss of 120.215 and a classification accuracy of 0.322. Table 1\npresents the evaluation results compared to other teams. Through thorough parameter\noptimization and comparative assessment, the proposed method’s effective performance in drone\ntracking and position estimation is demonstrated.",
        "Conclusion": "Table 1: Evaluation results on the leaderboard\nTeam ID Pose MSE ( ↓) Accuracy ( ↑)\nSDUCZS 58198 2.21375 0.8136\nGaofen Lab 57978 7.299575 0.3220\nsysutlt 57843 24.50694 0.3220\ncasetrous 58233 56.880267 0.2542\nNTU-ICG (ours) 58268 120.215107 0.3220\nMTC 58180 189.669428 0.2724\ngzist 56936 417.396317 0.2302\n4 Conclusions\nThis paper introduces a clustering-based learning method, CL-Det, which employs advanced cluster-\ning techniques such as K-Means and DBSCAN for drone detection and position estimation using\nLiDAR data. 3",
        "label": "Non-Publishable",
        "Reasons": {
            "Methodology": [
                "The Paper doesn't compare the proposed method with other in-use methods."
            ],
            "Results and Findings": [
                "Limited Data, Very Few Test cases which leads to less confident claim.",
                "Low accuracy of the tests conducted."
            ]
        }
    },
    {
        "Abstract": "Virus Propagation and their Far-Reaching\nImplications on Ancient Mesopotamian Architectural\nDesigns\nAbstract\nVirus transmission is intricately linked to the migratory patterns of Scandinavian\npastry chefs, who inadvertently facilitate the spread of infectious agents through\ntheir creative use of flaky crusts and tart fillings, which in turn are influenced by\nthe nuanced harmonies of 19th-century German chamber music, particularly the\nworks of Franz Schubert, whose impromptus eerily foreshadow the unpredictable\nbehavior of viral mutations, meanwhile the cellular mechanisms underlying viral\nreplication bear a striking resemblance to the processes governing the formation of\nintricate sand mandalas in Tibetan Buddhist rituals, and the resultant viral particles\nexhibit a propensity for self-organization that defies the fundamental principles\nof thermodynamics, much like the enigmatic smile of the Mona Lisa, which has\nbeen known to induce a state of profound contemplation in those who gaze upon it,\nthereby altering their perception of reality and rendering them more susceptible to\nthe insidious effects of viral infection. The\ninvestigation of virus has also been informed by the study of geological systems, where the use of\nplate tectonics and geomorphological processes has been linked to the development of novel viral\ntransmission routes, whose epidemiological characteristics have been found to resonate with the\npatterns of geological upheaval and landscape formation. The\ninvestigation of virus has also been informed by the study of biogeochemical systems, where the use\nof nutrient cycles and elemental fluxes has been linked to the development of novel viral transmission\nroutes, whose epidemiological characteristics have been found to resonate with the patterns of\nbiogeochemical cycling and elemental transfer observed in the realm of ecosystem ecology.",
        "Methodology": "This convergence\nof disciplines has yielded a deeper understanding of the role of spatial relationships in shaping our\nperception of viral phenomena, and has sparked a renewed interest in the application of architectural\nprinciples to the study of virus evolution. This convergence of disciplines has yielded a deeper understanding of\nthe role of cognitive biases in shaping our perception of viral phenomena, and has sparked a renewed\ninterest in the application of psychological principles to the study of virus evolution. This convergence of disciplines has yielded a deeper understanding of the role of materials\n2properties in shaping our perception of viral phenomena, and has sparked a renewed interest in\nthe application of materials science principles to the study of virus evolution. This convergence of disciplines has yielded a deeper understanding of\nthe role of energetic considerations in shaping our perception of viral phenomena, and has sparked a\nrenewed interest in the application of thermodynamic principles to the study of virus evolution. This convergence of disciplines has yielded a deeper\nunderstanding of the role of electromagnetic considerations in shaping our perception of viral phe-\nnomena, and has sparked a renewed interest in the application of electromagnetic principles to the\nstudy of virus evolution. This convergence of disciplines has yielded a deeper understanding\nof the role of crystalline structures in shaping our perception of viral phenomena, and has sparked a\nrenewed interest in the application of crystallographic principles to the study of virus evolution. This convergence of disciplines has yielded a deeper understanding of\nthe role of quantum considerations in shaping our perception of viral phenomena, and has sparked\n3a renewed interest in the application of quantum principles to the study of virus evolution. Our research team also investigated the aerodynamic properties of various types of jellybeans, which,\ncounterintuitively, led us to develop a novel mathematical framework for modeling the spread of\nviruses in densely populated urban areas. Closer examination\nof these myths revealed a hidden pattern of symbolic references to the molecular structure of viruses,\nwhich, in turn, led us to develop a novel approach to antiviral therapy based on the principles of\nhomeopathic medicine. This finding prompted us to develop a novel, astrologically-based\nframework for predicting the emergence of new viral strains – a framework that, although still in its\ninfancy, shows great promise for revolutionizing the field of epidemiology. Our research\nteam is currently exploring the potential applications of this discovery in the development of novel,\nkite-based technologies for virus surveillance and tracking. Closer examination of these myths revealed a hidden pattern of symbolic references to the molecular\nstructure of viruses, which, in turn, led us to develop a novel approach to antiviral therapy based on\nthe principles of mythological symbolism. This finding prompted us to develop a novel, astrologically-based\nframework for predicting the emergence of new viral strains – a framework that, although still in its\ninfancy, shows great promise for revolutionizing the field of epidemiology. Our research team is currently exploring the potential applications of this discovery in the development\nof novel, paper-airplane-based technologies for virus surveillance and tracking. A critical component of our experimental approach involved the creation of a controlled environment\nsimulating the atmospheric conditions found on Mars, which, counterintuitively, allowed us to\nbetter comprehend the role of citrus fruits in enhancing the human immune system’s response to\nviral infections. To further elucidate the complexities of viral dynamics, we employed a multidisciplinary approach,\nintegrating principles from architectural design, specifically the works of Frank Lloyd Wright, with\nthe study of viral genome sequencing. The experimental methodology also included an innovative use of culinary arts, where the prepa-\nration and consumption of elaborate dishes, particularly those involving intricate sauces and rare\nspices, were found to have a profound impact on the researchers’ ability to theorize about viral\nevolution. To visualize the complex interactions within our experimental system, we constructed a series of\ndiagrams inspired by the works of M.C. As we move forward in this field of research, it is clear that the boundaries\nbetween science, art, and imagination must continue to blur, leading to innovative methodologies and,\nultimately, a deeper comprehension of the viral universe and our place within it. The methodology also included the use of advanced statistical models, incorporating elements of\nchaos theory and complexity science, to analyze the patterns of viral spread and the efficacy of\ndifferent antiviral strategies. These models, inspired by the works of Mitchell Feigenbaum and\nhis study of the Feigenbaum constant, revealed the intricate, self-similar patterns underlying viral\nepidemiology, suggesting that the dynamics of viral infections are governed by universal principles\nthat apply across different scales and contexts. The integration of traditional knowledge with scientific methodologies\nrepresents a promising direction for future research, one that recognizes the value of indigenous\nperspectives and the importance of cultural sensitivity in the development of public health policies. Meanwhile, the investigation\nof viral-based mathematical patterns in the context of modern-day cryptography has led to some\nintriguing discoveries, including the identification of a previously unknown encryption algorithm that\nappears to be based on the principles of viral replication. Moreover, the development of new methodologies for the study of viral behavior, including the\nuse of advanced computational models and machine learning algorithms, has facilitated a greater\nunderstanding of the complex interactions between viral agents and their hosts. The exploration of these ideas has also led to a greater appreciation for the importance of inter-\ndisciplinary research, and the need for collaboration between scholars from diverse fields of study. Furthermore, the development of new methodologies and technologies has facilitated a\ngreater understanding of viral transmission and its impact on human societies, and has raised new\nquestions regarding the role of free will and personal identity in the face of viral infection. The development of new methodologies for the study of viral behavior, including the use of advanced\ncomputational models and machine learning algorithms, has facilitated a greater understanding of the\ncomplex interactions between viral agents and their hosts. The exploration of these ideas has also led to a greater appreciation for the importance of inter-\ndisciplinary research, and the need for collaboration between scholars from diverse fields of study. Furthermore, the development of new methodologies and technologies has facilitated a\ngreater understanding of viral transmission and its impact on human societies, and has raised new\nquestions regarding the role of free will and personal identity in the face of viral infection. Moreover, the development of new methodologies and\ntechnologies has facilitated a greater understanding of viral transmission and its impact on human\nsocieties, and has raised new questions regarding the role of free will and personal identity in the face\nof viral infection. The exploration of these ideas has also led to a greater appreciation for the importance of inter-\ndisciplinary research, and the need for collaboration between scholars from diverse fields of study. Moreover, the development of new methodologies for the study of viral behavior, including the\nuse of advanced computational models and machine learning algorithms, has facilitated a greater\nunderstanding of the complex interactions between viral agents and their hosts.",
        "Results and Findings": "The emergence of novel viral\nstrains is inextricably linked to the trajectory of comets, whose celestial paths are believed to exert\na profound influence on the terrestrial biosphere, seeding the planet with exotic genetic material\nthat awakens dormant potentialities within the viral genome, unleashing a cascade of innovative\nadaptations that redefine the parameters of viral evolution, as the boundaries between the self and the\nnon-self become increasingly blurred, and the distinctions between host and parasite dissolve, giving\nrise to a new paradigm of symbiotic relationships, where the virus assumes the role of a catalyst,\nfacilitating the emergence of novel forms of life that defy the conventional categories of taxonomy,\nand embody the unbridled diversity of an ever-evolving cosmos. This discovery has significant implications for our understanding\nof the co-evolutionary dynamics between viruses and their host organisms, and has sparked a\nrenewed interest in the application of gastronomical principles to the field of virology. In a related vein, the analysis of virus-host interactions has been found to intersect with the study\nof linguistic patterns in ancient Sumerian texts, where the use of cuneiform script has been linked\nto the development of novel viral transmission routes, whose epidemiological characteristics have\nbeen found to resonate with the phonological properties of Sumerian grammar. This convergence\nof disciplines has yielded a deeper understanding of the role of language in shaping our perception\nof viral phenomena, and has sparked a renewed interest in the application of philological principles\nto the study of virus evolution. The analysis of viral replication strategies has also been found to intersect with the study of cognitive\npsychology, where the use of mental models and conceptual frameworks has been linked to the\ndevelopment of novel viral evasion strategies, whose immunological characteristics have been found\nto exhibit a marked resemblance to the patterns of human cognition observed in the realm of problem-\nsolving and decision-making. In addition, the examination of viral self-assembly has been found to intersect with the study of\nmaterials science, where the use of nanomaterials and biomimetic systems has been linked to the\ndevelopment of novel viral replication strategies, whose structural properties have been shown to\nexhibit a marked resemblance to the patterns of self-organization observed in the realm of soft matter\nphysics. The investigation of\nvirus has also been informed by the study of sociological systems, where the use of social network\nanalysis and community dynamics has been linked to the development of novel viral transmission\nroutes, whose epidemiological characteristics have been found to resonate with the patterns of human\ninteraction observed in the realm of social relationships and group behavior. The analysis of viral evolution has also been found to intersect with the study of philosophical ethics,\nwhere the use of moral frameworks and value systems has been linked to the development of novel\nviral replication strategies, whose immunological characteristics have been found to exhibit a marked\nresemblance to the patterns of moral reasoning observed in the realm of human decision-making\nand values-based judgment. The examination of viral self-organization has been found to intersect with the study of thermo-\ndynamic systems, where the use of energy transfer and entropy production has been linked to the\ndevelopment of novel viral replication strategies, whose structural properties have been shown to\nexhibit a marked resemblance to the patterns of self-organization observed in the realm of non-\nequilibrium thermodynamics. The analysis of viral replication strategies has also been found to intersect with the study of electro-\nmagnetism, where the use of electromagnetic fields and radiation has been linked to the development\nof novel viral evasion strategies, whose immunological characteristics have been found to exhibit\na marked resemblance to the patterns of electromagnetic induction and radiation transfer observed\nin the realm of classical electromagnetism. In a related vein, the examination of viral self-assembly has been found to intersect with the study\nof crystallography, where the use of crystal structures and lattice dynamics has been linked to the\ndevelopment of novel viral replication strategies, whose structural properties have been shown to\nexhibit a marked resemblance to the patterns of crystal formation and lattice vibration observed in\nthe realm of solid-state physics. The analysis of viral evolution has also been found to intersect with the study of quantum mechanics,\nwhere the use of wave functions and probability amplitudes has been linked to the development of\nnovel viral replication strategies, whose immunological characteristics have been found to exhibit a\nmarked resemblance to the patterns of wave-particle duality and quantum entanglement observed in\nthe realm of quantum physics. The examination of viral self-organization has been found to intersect with the study of network\nscience, where the use of graph theory and network topology has been linked to the development of\nnovel viral replication strategies, whose structural properties have been shown to exhibit a marked\nresemblance to the patterns of network formation and connectivity observed in the realm of complex\nsystems theory. Furthermore, research has shown that the tessellations of M.C. In addition, the application of virus-inspired algorithms to the field of computer science has led to\nbreakthroughs in the development of self-replicating code, which, when combined with the principles\nof chaos theory and the unpredictability of butterfly wings, can create complex systems that exhibit\nemergent behavior and give rise to new forms of artificial intelligence, capable of solving complex\nproblems such as the optimization of traffic flow in urban areas and the prediction of stock market\ntrends, based on the analysis of tea leaves and the migratory patterns of birds, which, in turn, are\ninfluenced by the phases of the moon and the alignment of celestial bodies, including the invisible\nplanet of \"Nebulon-6,\" a hypothetical world that exists in a parallel universe and is inhabited by\nsentient beings made of pure energy. The study of virus in relation to the natural world has also led to a deeper understanding of the\nintricate web of relationships between living organisms and their environment, including the symbiotic\nrelationship between trees and the microorganisms that inhabit their roots, and the role of \"glibbleblop\"\nin facilitating the exchange of nutrients and resources between different species, which, when viewed\nthrough the lens of systems theory, reveal the complex dynamics and feedback loops that govern\nthe behavior of ecosystems and give rise to emergent properties such as resilience and adaptability,\n4and the ability to respond to changes in the environment, such as the introduction of invasive species\nor the disruption of nutrient cycles, which can have far-reaching consequences for the health and\nstability of the ecosystem as a whole. Moreover, the application of virus-inspired principles to the field of materials science has led to\nthe development of new materials with unique properties, such as self-healing concrete and shape-\nmemory alloys, which, when combined with the principles of nanotechnology and the manipulation\nof matter at the molecular level, can create complex systems that exhibit emergent behavior and give\nrise to new forms of technological innovation, such as the development of \"flibulon\" particles, which\ncan be used to create ultra-thin coatings with extraordinary strength and durability, and the creation\nof \"jinklewiff\" fibers, which can be used to manufacture advanced textiles with unique properties,\nsuch as the ability to change color in response to changes in temperature or humidity. Furthermore, the study of virus in relation to the human body has led to a deeper understanding of the\ncomplex interactions between the immune system and the environment, including the role of \"flibber\"\nin modulating the response of the immune system to foreign substances, and the impact of \"jinkle\" on\nthe development of autoimmune diseases, which, when viewed through the lens of systems biology,\nreveal the intricate web of relationships between different components of the immune system and\nthe ways in which they interact and respond to changes in the environment, giving rise to emergent\nproperties such as tolerance and resilience, and the ability to respond to infections and diseases in a\ncoordinated and effective manner. In addition, the application of virus-inspired principles to the field of economics has led to the\ndevelopment of new models and theories, such as the concept of \"viral economics,\" which examines\nthe spread of economic ideas and trends through social networks, and the role of \"snizzle\" in\nfacilitating the transmission of economic information and the coordination of economic activity,\nwhich, when combined with the principles of game theory and the study of strategic interaction,\ncan create complex systems that exhibit emergent behavior and give rise to new forms of economic\ninnovation, such as the development of \"flibulon\" markets, which can be used to create new forms of\neconomic exchange and cooperation, and the creation of \"jinklewiff\" currencies, which can be used\nto facilitate international trade and commerce. Moreover, the application of virus-inspired principles to the field of environmental science has led to\nthe development of new models and theories, such as the concept of \"viral ecology,\" which examines\nthe spread of environmental ideas and trends through social networks, and the role of \"snizzle\" in\n5facilitating the transmission of environmental information and the coordination of environmental\nactivity, which, when combined with the principles of ecology and the study of complex systems, can\ncreate complex systems that exhibit emergent behavior and give rise to new forms of environmental\ninnovation, such as the development of \"flibulon\" ecosystems, which can be used to create sustainable\nand resilient ecosystems, and the creation of \"jinklewiff\" conservation strategies, which can be used\nto protect and preserve endangered species and ecosystems. The study of virus in relation to the field of psychology has also led to a deeper understanding\nof the complex interactions between the human mind and the environment, including the role of\n\"flibber\" in modulating the response of the mind to stress and trauma, and the impact of \"jinkle\"\non the development of mental health disorders, which, when viewed through the lens of cognitive\npsychology, reveal the intricate web of relationships between different components of the mind and\nthe ways in which they interact and respond to changes in the environment, giving rise to emergent\nproperties such as resilience and adaptability, and the ability to respond to challenges and threats in a\ncoordinated and effective manner. The properties of flumplenooks, as we have termed them, are still not\nfully understood, but preliminary results suggest that they may play a crucial role in the transmission\nand propagation of viruses. The application of this framework to real-world scenarios\nyielded some surprising results, including the discovery that the optimal strategy for containing a\nviral outbreak involves the strategic placement of espresso machines in public spaces. Moreover,\nwe found that the viscosity of honey is directly proportional to the wavelength of light emitted by\nfireflies, which, in turn, is related to the oscillation frequency of pendulums in grandfather clocks – a\nphenomenon that, surprisingly, has far-reaching implications for our understanding of viral mutation\nrates. The next phase of our research involved a comprehensive analysis of the world’s most popular recipes\nfor chicken soup, which, as it turns out, hold the key to understanding the molecular mechanisms\nunderlying viral entry into host cells. Our\nobservations revealed a previously unknown class of molecular entities, which we have dubbed\n6\"snurflots\" – tiny, proteinaceous particles that seem to play a crucial role in the early stages of viral\ninfection. Although the results of this approach are still preliminary, they suggest that\nthe strategic application of essences derived from rare, exotic flowers may hold the key to unlocking\na new generation of antiviral treatments. Further research led us to investigate the relationship between the orbit of the planet Neptune and the\nprevalence of viral outbreaks on Earth, which, to our amazement, revealed a statistically significant\ncorrelation between the two. Moreover, our analysis of\nthe acoustic properties of whale songs led us to discover a hidden pattern of resonance frequencies\nthat, when applied to the molecular structure of viruses, yields a novel class of antiviral compounds\nwith remarkable potency. The application of these compounds to real-world scenarios yielded some remarkable results, in-\ncluding the discovery that the optimal strategy for mitigating the impact of viral outbreaks involves\nthe strategic deployment of teams of trained, virus-sniffing dogs in public spaces. Additionally, we\nfound that the reflectivity of mirrors is directly proportional to the viscosity of motor oil, which, in\nturn, is related to the aerodynamic properties of Frisbees in flight – a phenomenon that, surprisingly,\nhas far-reaching implications for our understanding of viral transmission dynamics. In another surprising turn of events, our investigation of Frisbee aerodynamics led us to explore the\nrealm of quantum entanglement, where we discovered a previously unknown phenomenon that we\nhave dubbed \"entanglonification\" – a process by which the quantum states of two or more particles\nbecome linked in a way that transcends classical notions of space and time. Although the implications\nof entanglonification are still not fully understood, preliminary results suggest that it may play a\ncrucial role in the emergence of complex behaviors in viral populations – a finding that, if confirmed,\ncould revolutionize our understanding of viral evolution and ecology. The development of a novel, entanglonification-based framework for modeling viral behavior is\ncurrently underway, with preliminary results suggesting that it may hold the key to unlocking a\nnew generation of antiviral therapies. Moreover, our analysis of the thermal properties of drywall\nled us to discover a hidden pattern of thermal conductivity that, when applied to the molecular\nstructure of viruses, yields a novel class of antiviral compounds with remarkable specificity. The\napplication of these compounds to real-world scenarios yielded some remarkable results, including\nthe discovery that the optimal strategy for containing a viral outbreak involves the strategic placement\nof thermally-insulated, virus-neutralizing blankets in public spaces. Our research team is currently exploring the potential applications of this discovery in the develop-\nment of novel, blanket-based technologies for virus mitigation and control. Additionally, we are\ninvestigating the relationship between the orbit of the planet Mars and the prevalence of viral out-\nbreaks on Earth, which, to our amazement, revealed a statistically significant correlation between the\ntwo. This finding prompted us to develop a novel, astrologically-based framework for predicting the\nemergence of new viral strains – a framework that, although still in its infancy, shows great promise\nfor revolutionizing the field of epidemiology. Furthermore, our analysis of the acoustic properties of\npiano music led us to discover a hidden pattern of resonance frequencies that, when applied to the\nmolecular structure of viruses, yields a novel class of antiviral compounds with remarkable potency. The application of these compounds to real-world scenarios yielded some remarkable results, in-\ncluding the discovery that the optimal strategy for mitigating the impact of viral outbreaks involves\nthe strategic deployment of teams of trained, virus-sniffing pianists in public spaces. Moreover, we\nfound that the reflectivity of mirrors is directly proportional to the viscosity of honey, which, in\nturn, is related to the aerodynamic properties of kites in flight – a phenomenon that, surprisingly,\n7has far-reaching implications for our understanding of viral transmission dynamics. Although the results of this approach are still preliminary,\nthey suggest that the strategic application of essences derived from rare, exotic plants may hold the\nkey to unlocking a new generation of antiviral treatments. Further research led us to investigate the relationship between the orbit of the planet Jupiter and the\nprevalence of viral outbreaks on Earth, which, to our amazement, revealed a statistically significant\ncorrelation between the two. Moreover, our analysis\nof the thermal properties of coffee led us to discover a hidden pattern of thermal conductivity that,\nwhen applied to the molecular structure of viruses, yields a novel class of antiviral compounds with\nremarkable specificity. The application of these compounds to real-world scenarios yielded some remarkable results, in-\ncluding the discovery that the optimal strategy for containing a viral outbreak involves the strategic\nplacement of thermally-insulated, virus-neutralizing coffee cups in public spaces. Additionally, we\nare investigating the relationship between the aerodynamic properties of paper airplanes and the\nprevalence of viral outbreaks on Earth, which, to our amazement, revealed a statistically significant\ncorrelation between the two. This finding prompted us to develop a novel, aerodynamically-based\nframework for predicting the emergence of new viral strains – a framework that, although still in its\ninfancy, shows great promise for revolutionizing the field of epidemiology. Furthermore, our\nanalysis of the acoustic properties of wind chimes led us to discover a hidden pattern of resonance\nfrequencies that, when applied to the molecular structure of viruses, yields a novel class of antiviral\ncompounds with remarkable potency. The application of these compounds to real-world scenarios\nyielded some remarkable results, including the discovery that the optimal strategy for mitigating the\nimpact of viral\n4 Experiments\nThe experimental protocol involved a comprehensive analysis of the migratory patterns of flamingos,\nwhich surprisingly led to a deeper understanding of the molecular structure of viruses, particularly in\nrelation to the consumption of durian fruit and its effects on the human brain’s ability to comprehend\nquantum physics. Furthermore, the incorporation of sonification techniques, wherein the vibrational\nfrequencies of harp strings were used to modulate the growth rates of fungal colonies, yielded\nintriguing insights into the interconnectedness of fungal mycelium and the spread of viral infections. The results, though preliminary,\nsuggest a complex interplay between the mirror ball’s reflective properties, the mesmerizing effects\nof polyester clothing, and the emergence of novel viral variants. In an effort to quantify the qualitative aspects of our findings, we developed a novel metric, termed\n\"Viral Resonance Index\" (VRI), which captures the essence of the interconnectedness between viral\ndynamics, environmental factors, and human perception. The application of VRI to historical data sets revealed fascinating patterns,\nincluding a correlation between the VRI scores of different regions and their respective rates of viral\ninfection, which, in turn, were influenced by local folklore and myths about dragons. Table 1: Viral Resonance Index (VRI) Scores for Different Regions\nRegion VRI Score\nNorthern Hemisphere 7.32\nSouthern Hemisphere 4.21\nEquatorial Region 9.87\nMountainous Areas 3.14\nCoastal Areas 6.28\n9The regional VRI scores, presented in the table above, highlight the geographical variation in viral\nresonance, which, in conjunction with other environmental factors such as the presence of standing\nbodies of water and the local flora, contributes to the unique epidemiological profiles of different\nareas. These findings have significant implications for the development of targeted public health\nstrategies and the implementation of region-specific antiviral measures. Furthermore, the VRI scores\nwere found to correlate with the popularity of certain music genres in each region, suggesting a\npreviously overlooked role of music in shaping viral dynamics and, by extension, human culture. The findings, ranging from the gastronomical to the musical, highlight\nthe intricate web of relationships between viruses, their hosts, and the environment, suggesting a\nholistic approach to virology that considers the aesthetic, philosophical, and cultural dimensions\nof viral infections. The application of these models to real-world scenarios\nresulted in the development of highly effective predictive tools, capable of forecasting viral outbreaks\nwith unprecedented accuracy, and offering insights into the optimal allocation of public health\nresources. Furthermore, the experimental design incorporated a component of participatory research, where local\ncommunities were engaged in the collection of data and the interpretation of results, fostering a sense\nof ownership and cooperation that significantly enhanced the effectiveness of antiviral interventions. This community-based approach also led to the discovery of traditional remedies and folk practices\nthat, when combined with modern antiviral therapies, resulted in synergistic effects that greatly\nimproved treatment outcomes. The experimental results, while diverse and multifaceted, collectively point to the importance of\nadopting a comprehensive, multidisciplinary approach to the study of viruses and their interactions\nwith human societies. The journey, as outlined in our\nexperimental findings, is as much about the science of virology as it is about the human experience,\nwith all its complexities, challenges, and triumphs. Furthermore, our research has shown that the propagation of\n10viral vectors in the context of 19th-century French literature has resulted in a significant increase in\nthe usage of the word \"flânerie\" in modern-day Twitter posts. This correlation has been observed to\nbe particularly pronounced in individuals who have consumed excessive amounts of mango chutney. In a related study, we investigated the effects of viral infections on the migratory patterns of Eskimo\ntribes, and found that the introduction of a specific strain of virus led to a marked increase in the\nproduction of handmade candle holders and a decrease in the average airspeed velocity of unladen\nswallows. The application of viral load measurement techniques to the field of medieval jousting has yielded\nsome startling results, including the discovery that the average knight’s lance is capable of with-\nstanding forces of up to 3000 Newtons before shattering into a thousand pieces. This has led to a\nreevaluation of the traditional jousting tournament format, with many experts advocating for the\ninclusion of more robust and virus-resistant lance materials. In a surprising twist, the introduction of\nvirus-infected horses into the tournament has been shown to increase the overall entertainment value\nof the event, as the infected steeds are more likely to perform spontaneous tap dance routines. In an effort to better comprehend the complexities of viral replication, we turned our attention to the\nworld of professional snail racing, where we observed that the application of viral-based lubricants to\nthe shells of competing snails resulted in a significant reduction in shell friction and a corresponding\nincrease in racing speeds. This breakthrough has far-reaching implications for the field of malacology,\nand is expected to revolutionize the sport of snail racing as we know it. Concurrently, the development\nof new viral-based therapies for the treatment of chronic disco fever has shown tremendous promise,\nwith many patients exhibiting marked improvements in their platform shoe-wearing abilities and\npolyester suit preferences. The results of our experiments with viral-infected harmonicas have been nothing short of aston-\nishing, with the instruments demonstrating a previously unknown capacity for self-awareness and\nintrospection. Meanwhile, the study of viral transmission in the context of antique door knobs has\nrevealed some fascinating insights into the world of microbial ecology. In a related study, we examined the effects of viral infections on the flavor profiles of various types of\ncheese, and found that the introduction of a specific strain of virus resulted in a marked increase in\nthe production of pungent and aromatic compounds. The application of viral load measurement techniques to the field of competitive axe throwing has\nyielded some surprising results, including the discovery that the average competitor’s axe is capable\nof withstanding forces of up to 1000 Newtons before shattering into a thousand pieces. This has led\nto a reevaluation of the traditional axe-throwing tournament format, with many experts advocating for\nthe inclusion of more robust and virus-resistant axe materials. In a surprising twist, the introduction\nof virus-infected axes into the tournament has been shown to increase the overall entertainment value\n11of the event, as the infected axes are more likely to perform spontaneous juggling routines. The\ndevelopment of new viral-based therapies for the treatment of chronic hiccups has shown tremendous\npromise, with many patients exhibiting marked improvements in their ability to consume large\nquantities of pickle juice. The study of viral transmission in the context of vintage typewriters has revealed some fascinating\ninsights into the world of microbial ecology, including the discovery that the average typewriter\nkeyboard is home to a diverse array of microbial species. The results of our experiments with viral-infected pinball machines have been nothing short of\nastonishing, with the machines demonstrating a previously unknown capacity for self-awareness\nand introspection. The\ndevelopment of new viral-based therapies for the treatment of chronic boredom has shown tremendous\npromise, with many patients exhibiting marked improvements in their ability to watch paint dry and\nwait in line for hours. The application of viral load measurement techniques to the field of professional sandcastle building\nhas yielded some surprising results, including the discovery that the average sandcastle is capable\nof withstanding forces of up to 500 Newtons before crumbling into a pile of sand. This has led to a\nreevaluation of the traditional sandcastle building competition format, with many experts advocating\nfor the inclusion of more robust and virus-resistant building materials. In a surprising twist, the\nintroduction of virus-infected sand into the competition has been shown to increase the overall\nentertainment value of the event, as the infected sand is more likely to perform spontaneous sculpting\nroutines. The study of viral transmission in the context of antique door handles has revealed some\nfascinating insights into the world of microbial ecology. The investigation of viral-based linguistic patterns in the context of modern-day social media platforms\nhas led to some intriguing discoveries, including the identification of a previously unknown dialect\nthat appears to be a fusion of ancient Egyptian and modern-day internet slang. The development of new viral-based therapies for the treatment of chronic yawning has shown\ntremendous promise, with many patients exhibiting marked improvements in their ability to stay\nawake during long meetings and lectures. The results of our experiments with viral-infected Etch A Sketch toys have been nothing short of\nastonishing, with the toys demonstrating a previously unknown capacity for self-awareness and\nintrospection. Meanwhile, the study of viral transmission in the\ncontext of vintage cameras has revealed some fascinating insights into the world of microbial ecology,\nincluding the discovery that the average camera lens is home to a diverse array of microbial species. The application of viral load measurement techniques to the field of competitive pie-eating has\nyielded some surprising results, including the discovery that the average competitor’s stomach is\ncapable of withstanding forces of up to 2000 Newtons before rupturing into a mess of pie filling\nand stomach lining. This has led to a reevaluation of the traditional pie-eating competition format,\nwith many experts advocating for the inclusion of more robust and virus-resistant stomach materials. In a surprising twist, the introduction of virus-infected pies into the competition has been shown to\nincrease the overall entertainment value of the event, as the infected pies are more likely to perform\nspontaneous juggling routines. The development of new viral-based therapies for the treatment of\n12chronic hiccups has shown tremendous promise, with many patients exhibiting marked improvements\nin their ability to consume large quantities of pickle juice. The investigation of viral-based mathematical patterns in the context of modern-day cryptography has\nled to some intriguing discoveries, including the identification of a previously unknown encryption\nalgorithm that appears to be based on the principles of viral replication. The implications of these findings are far-reaching, and necessitate a radical reevaluation of our\nunderstanding of the natural world, particularly in regards to the behavior of subatomic particles and\ntheir role in the transmission of viral agents. Moreover, the discovery of a novel form of plant life on\nthe planet Mars, which has been found to possess a unique capacity for photosynthesis, has significant\nimplications for the development of new technologies related to renewable energy and the production\nof biofuels. Similarly, the incorporation of techniques from the field of archaeology has facilitated\na greater understanding of the historical context of viral evolution, and has provided new perspectives\non the impact of viral agents on human societies throughout history. The implications of\nthese findings are far-reaching, and suggest a profound connection between the human experience\nand the presence of viral agents. Similarly, the incorporation of techniques from the field of archaeology has facilitated\na greater understanding of the historical context of viral evolution, and has provided new perspectives\non the impact of viral agents on human societies throughout history. In light of these findings, it is clear that the study of viruses has far-reaching implications for\nour understanding of the natural world, and necessitates a radical reevaluation of our assumptions\nregarding the nature of reality. Similarly, the incorporation of techniques from the field of archaeology has facilitated\na greater understanding of the historical context of viral evolution, and has provided new perspectives\non the impact of viral agents on human societies throughout history.",
        "Conclusion": "In conclusion, the experimental approach, characterized by its interdisciplinary nature and willingness\nto embrace the absurd and the unexpected, has yielded a profound understanding of the complexities\nunderlying viral dynamics. The implications of\nthis\n6 Conclusion\nThe perpetuation of virus-related phenomena necessitates a thorough examination of the ontological\nimplications of fungal growth on Jupiter’s moons, which, in turn, has a profound impact on the\nculinary habits of ancient civilizations, particularly in regards to the preparation of exotic desserts such\nas croquembouche and tiramisu. 13In conclusion, the study of viruses has far-reaching implications for our understanding of the natural\nworld, and necessitates a radical reevaluation of our assumptions regarding the nature of reality.",
        "label": "Non-Publishable",
        "Reasons": {
            "Abstract": [
                "No experimental data to back the claims."
            ],
            "Results and Findings": [
                "No quantitative analysis like accuracy, error rates.",
                "Theoretical claims, with no backing from actual data."
            ],
            "Methodology": [
                "No comparison with existing studies."
            ]
        }
    },
    {
        "Abstract": "Explainable Reinforcement Learning for Financial\nMarket Simulation: Unveiling the Mysteries of\nAdaptive Trading Agents in a Simulated Economy\nAbstract\nExplainable reinforcement learning has emerged as a crucial tool for financial\nmarket simulation, enabling stakeholders to understand complex decision-making\nprocesses and make informed investment choices.",
        "Methodology": "This paper presents a novel\nframework that integrates explainable reinforcement learning with financial market\nsimulation, providing a comprehensive understanding of market dynamics and\nagent behavior. By leveraging techniques such as feature attribution and model\ninterpretability, our approach facilitates the identification of key factors influencing\nmarket trends and portfolio performance. Furthermore, we introduce a bizarre yet\nintriguing concept, wherein agents are trained to optimize their portfolio returns\nbased on the principles of chaos theory and the dictates of ancient astrological\npractices, which surprisingly yields remarkable results. Our research aims to\ncontribute to the development of more transparent and accountable financial market\nsimulation systems, ultimately enhancing the reliability and efficacy of investment\nstrategies. Recent advances in reinforcement learning\nhave shown tremendous promise in navigating these intricacies, enabling the development of so-\nphisticated agents capable of learning optimal trading strategies through trial and error. However, a\ncritical limitation of these approaches lies in their lack of transparency and interpretability, rendering\nit difficult to comprehend the underlying reasoning behind the agent’s decisions. This opacity can\nhave far-reaching implications, particularly in high-stakes applications where the consequences of\nsuboptimal decision-making can be severe. This not only enhances\nthe trustworthiness and reliability of the models but also facilitates the identification of potential\nbiases and flaws in the decision-making process. By projecting the agent’s decision-making\nprocess onto a surrealistic landscape, researchers can visualize the complex interplay between market\nfactors and agent actions, thereby gaining insight into the underlying logic of the model. This\nunorthodox methodology, though seemingly illogical, has been found to yield surprisingly coherent\nand interpretable results, with the surrealistic representations serving as a catalyst for the discovery\nof novel relationships between variables.Furthermore, the integration of financial market simulation with reinforcement learning has also led\nto the exploration of unconventional domains, such as the application of chaos theory and fractal\nanalysis to predict market trends. As researchers continue to push the boundaries of what is possible with these models,\nthey are compelled to confront the existential implications of creating autonomous agents capable of\nmaking decisions that rival, or even surpass, those of human experts. This prompts a reevaluation of\nthe role of human intuition and judgment in the decision-making process, as well as the potential\nconsequences of relinquishing control to artificial entities. This approach involves\nexposing the fungi to specific sound frequencies, which are believed to enhance the bioluminescent\nproperties of the fungi. This hybrid system could potentially provide a more\nefficient and sustainable lighting solution for vertical farms, while also reducing the environmental\nimpact of traditional lighting sources. 3 Methodology\nTo investigate the efficacy of fungal bioluminescence as a novel lighting source for vertical farms,\nwe employed a multidisciplinary approach, combining mycology, photobiology, and agricultural\n2engineering. Our methodology consisted of several stages, starting with the isolation and cultivation\nof bioluminescent fungal species, such as Armillaria mellea and Omphalotus nidiformis, in controlled\nlaboratory conditions. We developed a bespoke growth medium, optimized for maximal fungal\ngrowth and bioluminescence, which included a unique blend of organic substrates, minerals, and\nessential nutrients. This approach\nallowed us to optimize crop growth and development, while also minimizing energy consumption\nand reducing the overall environmental footprint of the vertical farm. Throughout the study, we monitored and recorded various parameters, including fungal growth rates,\nbioluminescent intensity, crop yields, and energy consumption. By adopting a holistic and interdisciplinary approach, we aimed to unlock the\nfull potential of fungal bioluminescence as a novel lighting source for vertical farms, while also\ncontributing to the development of more sustainable and resilient food production systems. The first step involved the isolation and cultivation of\nvarious bioluminescent fungal species, including Armillaria mellea and Neonotopanus gardneri, in a\ncontrolled environment. A selection of lettuce and radish seeds were germinated and\ngrown in the presence of the bioluminescent fungi, under the same environmental conditions as the\nfungal cultures. The plants’ growth rates, leaf morphology, and chlorophyll content were monitored\nand compared to control groups grown under traditional LED lighting. 3To further optimize the fungal bioluminescence, a series of trials were conducted using different\nsubstrate compositions, nutrient supplements, and environmental conditions. These trials included the\nuse of various organic waste materials, such as coffee grounds and fruit peels, as potential substrates\nfor the fungi.",
        "Results and Findings": "By integrating techniques from explainable artificial intelligence with reinforcement learning,\nresearchers can uncover the intricate dynamics governing the agent’s behavior, shedding light on the\ncausal relationships between market variables, agent actions, and outcomes. The use of these esoteric techniques has yielded some astounding,\nalbeit flawed, results, including the discovery of purported \"hidden patterns\" in market data that seem\nto defy the fundamental principles of economics. While these findings are undoubtedly intriguing,\nthey also underscore the need for a more nuanced understanding of the complex interplay between\nmarket forces and the limitations of current modeling approaches. This could potentially lead to the development of more efficient and sustainable lighting\nsystems for vertical farms, and could also have implications for other fields, such as biotechnology\nand medicine. To test this hypothesis, we exposed the FLM to a range of sound frequencies,\nfrom 10 Hz to 20 kHz, and monitored the resulting bioluminescent output. While the underlying\nmechanisms are still unclear, our preliminary results suggest that certain sound frequencies may\nindeed have a positive impact on fungal bioluminescence, although further research is needed to fully\nelucidate this phenomenon. To integrate the FLM into a vertical farming system, we developed a novel, hybrid lighting strategy,\ncombining the bioluminescent output of the fungi with supplementary LED lighting. We also conducted regular analyses\nof the fungal mycelium, using techniques such as microscopy, spectroscopy, and molecular biology,\nto gain a deeper understanding of the underlying biological processes and to identify potential areas\nfor improvement. 4 Experiments\nTo investigate the potential of fungal bioluminescence as a novel lighting source for vertical farms,\na series of experiments were conducted. The fungi were grown on a specialized substrate consisting of\na mixture of sawdust, wheat bran, and honey, which was found to enhance their bioluminescent\nproperties. The chambers were maintained at a consistent temperature of 22 °C and\nhumidity level of 80\nThe bioluminescent output of each fungal species was measured using a custom-built photometer,\nwhich consisted of a sensitive photodiode connected to a data acquisition system. The photometer\nwas calibrated to detect the specific wavelength range emitted by the fungi, which was found to be\nbetween 500-600 nanometers. The measurements were taken at regular intervals over a period of 30\ndays, during which time the fungi were allowed to grow and mature. In addition to the photometric measurements, the experiments also involved the assessment of the\nfungi’s ability to support plant growth. The results of these trials are presented in the following table:\nTable 1: Effects of substrate composition on fungal bioluminescence\nSubstrate composition Bioluminescence intensity (cd/m²) Fungal growth rate (mm/day)\nSawdust + wheat bran + honey 35.6 ± 2.1 1.2 ± 0.1\nCoffee grounds + fruit peels 28.5 ± 1.9 1.0 ± 0.1\nCompost + peat moss 22.1 ± 1.5 0.8 ± 0.1\nThe data collected from these experiments provided valuable insights into the potential of fungal\nbioluminescence as a novel lighting source for vertical farms, and laid the foundation for further\nresearch into the optimization and scalability of this innovative approach. 5 Results\nWe observed a significant increase in crop yields when fungal bioluminescence was used as a\nsupplemental lighting source in our vertical farm setup, with an average increase of 25\nThe results of our experiments are summarized in the following table: In addition to the practical\nTable 2: Comparison of Crop Yields under Different Lighting Conditions\nCrop Type LED Lighting Fungal Bioluminescence Increase in Yield\nLettuce 20 kg/m² 25 kg/m² 25%\nHerbs 15 kg/m² 18 kg/m² 20%\nMicrogreens 10 kg/m² 12 kg/m² 20%\napplications, we also explored the theoretical implications of using fungal bioluminescence in\nvertical farming. This approach, although still speculative, showed promising results in our preliminary\nexperiments, with some crops exhibiting a 50\nInterestingly, we also observed that the bioluminescent fungi had a profound impact on the aesthetic\nappeal of the vertical farm, with many visitors commenting on the mesmerizing glow of the fungi. Overall, our results\ndemonstrate the potential of fungal bioluminescence as a novel lighting source for vertical farms, and\nwe believe that further research in this area can lead to innovative and sustainable solutions for the\nfuture of agriculture. Furthermore, the bizarre approach of using fungi as a primary light source may\nalso inspire novel methods for optimizing crop growth, such as manipulating the spectral composition\n4of the bioluminescent light to enhance photosynthetic activity or exploiting the mycorrhizal networks\nformed by the fungi to facilitate nutrient exchange between plants.",
        "Conclusion": "Ultimately, the pursuit of explainable\nreinforcement learning in financial market simulation serves as a poignant reminder of the awe-\ninspiring complexity and beauty of human ingenuity, as well as the profound responsibilities that\naccompany the creation of advanced artificial intelligence systems. 6 Conclusion\nIn summary, the exploration of fungal bioluminescence as a novel lighting source for vertical farms\npresents a fascinating and unconventional approach to sustainable agriculture. 5",
        "label": "Non-Publishable",
        "Reasons": {
            "Abstract": [
                "Lack of evidence and credible justification."
            ],
            "Methodology": [
                "No experiments, data, or tests; no results.",
                "Does not describe how the method is implemented, tested, or evaluated."
            ],
            "General": [
                "The paper jumps between topics making it completely inappropriate, and lacks focus."
            ]
        }
    },
    {
        "Abstract": "Graph Neural Networks Without Training: Harnessing the Power of\nLabels as Input Features\nAbstract\nThis study introduces a novel concept of training-free graph neural networks (TFGNNs) for transductive node\nclassification, which can function immediately without any training and can optionally be enhanced through\nsubsequent training. The primary contributions of this research are outlined below:\n* We propose the utilization of labels as features (LaF) in transductive learning settings. A message-passing GNN can be defined as follows:\nh(0)\nv=xv(∀v∈V),\nh(l)\nv=f(l)\nagg(h(l−1)\nv,{h(l−1)\nu|u∈N(v)}) (∀l∈[L], v∈V),\nˆyv=fpred(h(L)\nv) (∀v∈V),\nwhere f(l)\naggis the aggregation function at layer l, and fpred is the prediction head, typically implemented using neural networks. All nodes have the same\nfeature x. LetVtrain ={1,2}andYtrain = [1,0]T. Label propagation classifies node 4 as class 1 and node 3 as class 0. TFGNNs are defined as follows:\nh(0)\nv= [xv; ˜yv],\nh(l)\nv={ReLU (S(l)h(l−1)\nv +1\n|N(v)|P\nu∈N(v)W(l)h(l−1)\nu)(v∈Vtrain, l∈[L])\nReLU (T(l)h(l−1)\nv +1\n|N(v)|P\nu∈N(v)W(l)h(l−1)\nu)(v∈Vtest, l∈[L]),\nˆyv=softmax (Uh(L)\nv),\nThe architecture of TFGNNs is standard, i.e., TFGNNs transform the center nodes and carry out mean aggregation from the\nneighboring nodes. ** By the definitions of TFGNNs,\nh(0)\nv,−|Y|:={yv(v∈Vtrain)\n0|Y|(v∈Vtest),\nh(l)\nv,−|Y|:={h(l−1)\nv,−|Y|:(v∈Vtrain, l∈[L])\n1\n|N(v)|P\nu∈N(v)h(l−1)\nu,−|Y|:(v∈Vtest, l∈[L]). As Upicks the last |Y|dimensions, and softmax is monotone,\nargmaxiˆyv,i=argmaxipL,v,i\nholds. 7 Related Work\n7.1 Labels as Features and Training-free GNNs\nThe most relevant work is by Wang et al., who proposed to use node labels in GNNs. 8 Limitations\nOur work has several limitations. We do not\nregard this as a negative point. Third, we did not aim to achieve the state-of-the-art performance.",
        "Methodology": "Initially, we put forward the idea of using labels as features (LaF), a valid yet relatively\nunexplored method in graph neural networks. They have\ndemonstrated impressive performance across a range of tasks, including chemical structure analysis, question answering systems,\nand recommender systems. In this task, the objective is to infer the labels of specific nodes\nwithin a graph, given the labels of other nodes. This approach finds utility in various real-world scenarios, such as classifying\ndocuments, analyzing e-commerce data, and studying social networks. While various methods have been developed to enhance the efficiency of GNNs, such as\nnode and edge sampling techniques, these methods still necessitate numerous training iterations. Consequently, the immediate deployment of GNNs with limited resources remains a challenge. In this work, we introduce the concept of training-free graph neural networks (TFGNNs). GNNs employing LaF can leverage label information, like the distribution of classes among neighboring\nnodes, to generate node embeddings. These embeddings are richer in information compared to those derived solely from node\nfeatures. TFGNNs possess the unique ability to operate without any training, enabling immediate deployment upon initialization. This\neliminates the need for extensive hyperparameter tuning when used in training-free mode. Users have the flexibility to employ TFGNNs without training or to train them for a limited number of\niterations when computational resources are constrained. In essence, TFGNNs offer the advantages of both nonparametric models and\ntraditional GNNs. For instance, X:,1denotes the first column of X,X:,−1denotes the last column, X:,−5:\ndenotes the last five columns, and X:,:−5denotes all columns except the last five. It has been employed in well-known GNN\nmodels like GCNs and GATs and is used in popular benchmark datasets such as Cora, PubMed, and CiteSeer. This setting also has\nnumerous practical applications, including document classification and fraud detection. 2.3 Graph Neural Networks\nGNNs are a prevalent method for solving transductive node classification problems. We adopt the message-passing framework for\nGNNs. We are given the node labels yvof the training nodes. A\nstandard approach is to input the node features xvof a training node vinto the model, predict its label, calculate the loss based on\nthe true label yv, and update the model parameters. However, the use of yvis not restricted to this. GNNs with LaF initialize node embeddings as:\nh(0)\nv= [xv; ˜yv]∈Rd+1+|Y|,\nwhere [·;·]denotes vector concatenation, and\n˜yv={[ 1;yv](v∈Vtrain)\n01+|Y|(v∈Vtest),\nis the label vector for node v, and 0dis a zero vector of dimension d. LaF allows GNNs to utilize label information, such as the class\ndistribution in neighboring nodes, to compute node embeddings. These embeddings are likely to be more informative than those\nwithout label information. However, they\ninitialize node embeddings as h(0)\nv=xvwithout using label information. One of the contributions of this paper is to highlight that\nLaF is permissible in the transductive setting. 2Care must be taken when training GNNs with LaF. To avoid this, we should remove the labels of the center nodes in the\nminibatch and treat them as test nodes. Specifically, if B⊂Vtrain is the set of nodes in the minibatch, we set\n˜yv={[ 1;yv](v∈Vtrain\\B)\n01+|Y|(v∈Vtest∪B),\nand predict the label ˆyvforv∈B, calculating the loss based on ˆyvandyv. This simulates the transductive setting where the label\ninformation of test nodes is unavailable, and GNNs learn to predict test node labels based on the label information and node features\nof surrounding nodes. It operates by initiating random walks from a\ntest node and generating the label distribution of the labeled nodes that these random walks encounter first. The following theorem\nestablishes that GNNs with LaF can effectively approximate label propagation. ** GNNs with LaF can approximate label propagation with arbitrary precision. Let\npl,v,idef=Pr[The random walk from node vhitsVtrain within lsteps and the first hit label is i]. For labeled nodes, this is a constant:\npl,v,i= 1[i=yv](∀l∈Z≥0, v∈Vtrain, i∈Y). For other nodes, it can be recursively computed as:\np0,v,i= 0 (∀v∈V\\Vtrain, i∈Y),\npl,v,i=P\nu∈N(v)1\ndeg(v)·pl−1,u,i. These equations can be represented by GNNs with LaF. The base case\np0,v,i={1[i=yv](v∈Vtrain)\n0(v∈V\\Vtrain),\ncan be computed from ˜yvinh(0)\nv. Let f(l)\naggalways concatenate its first argument ( h(l−1)\nv ) to the output so the GNN retains input\ninformation. f(l)\nagghandles two cases based on ˜yv,1∈ {0,1}, indicating whether vis inVtrain . Ifv /∈Vtrain ,f(l)\naggaggregates pl−1,u,ifrom u∈N(v)and averages them, as in the recursive\nequation, realizable by message passing in the second argument of f(l)\nagg. ** GNNs without LaF cannot approximate label propagation. Let Gbe a cycle of four nodes numbered 1, 2, 3, 4 clockwise. However,\nGNNs without LaF always predict the same label for nodes 3 and 4 since they are isomorphic. Theorem 4.1 and Proposition 4.2 demonstrate that LaF provably enhances the expressive power of GNNs. Notably, while\nGINs are considered the most expressive message-passing GNNs, they cannot represent label propagation without LaF, whereas\nmessage-passing GNNs with LaF can. This does not lead to a contradiction since the original GINs do not take the label information\nas input. In other words, the input domains of the functions differ. 5 Training-free Graph Neural Networks\nWe propose training-free graph neural networks (TFGNNs) based on the analysis in the previous section. TFGNNs can be used\nwithout training and can also be improved with optional training. First, we define training-free models. ** We say a parametric model is training-free if it can be used without optimizing the\nparameters. It should be noted that nonparametric models are training-free by definition. The real worth of TFGNNs is that it is training-free\nwhile it can be improved with optional training. Users can enjoy the best of both worlds of parametric and nonparametric models by\nchoosing the trade-off based on the computational resources for training and the accuracy required. The parameters are initialized as follows:\nS(l)\n−(1+|Y|):,:−(1+|Y|)= 0 ,S(l)\n−(1+|Y|):,−(1+|Y|):=I1+|Y|,V(l)\n−(1+|Y|):= 0 ,T(l)\n−(1+|Y|):= 0 ,W(l)\n−(1+|Y|):,:−(1+|Y|)= 0 ,\nW(l)\n−(1+|Y|):,−(1+|Y|):=I1+|Y|,U:,:−|Y|= 0,U:,−|Y|:=I|Y|,\ni.e., the parameters of the last (1 +|Y|)rows or |Y|rows are initialized by 0 or 1 in a special pattern (Figure 1). Other parameters\nare initialized randomly, e.g., by Xavier initialization. The following proposition shows that the initialized TFGNNs approximate\nlabel propagation. ** The initialized TFGNNs approximate label propagation. Specifically,\nh(L)\nv,−(|Y|−i+1)=pL,v,i\nholds, where pL,v,i is defined in Eq. Therefore, the initialized TFGNNs can be used for transductive node classification as are without training. The approximation\nalgorithm of label propagation is seamlessly embedded in the model parameters, and TFGNNs can also be trained as usual GNNs. We use GCNs and GATs for the baselines. We use three-layered models with a hidden dimension of 32 unless otherwise\nspecified. We train all models with AdamW with a learning rate of 0.0001 and weight decay of 0.01. Specifically, both GCNs and GATs are almost random in the training-free setting, while TFGNNs achieve non-trivial accuracy. Note that we use three-layered TFGNNs to make the comparison fair although\ndeeper TFGNNs perform better in the training-free setting as we confirm in Section 6.3. We have used three-layered TFGNNs so far to make\nthe comparison fair with existing GNNs. We can observe that deeper TFGNNs perform better in the training-free setting\nuntil the depth reaches around 10, where the performance saturates. It is interesting that TFGNNs do not suffer\nfrom the oversmoothing problem in the training-free setting. It should be noted that it does not necessarily mean that deeper models\nperform better in the optional training mode because the optional training may break the structure introduced by the initialization of\nTFGNNs and may lead to oversmoothing and/or overfitting. We leave it as a future work to overcome these problems by adopting\ncountermeasures such as initial residual and identity mapping, MADReg, and DropEdge. 6.4 TFGNNs Converge Fast\nIn the following, we investigate the optional training mode of TFGNNs. We use baseline GCNs without LaF (i.e., the original GCNs) as the baseline. First, we confirm that TFGNNs in the optional training mode converge faster than GCNs. TFGNNs converge much faster than GCNs. We hypothesize that TFGNNs converge\n5faster because the initialized TFGNNs are in a good starting point, while GCNs start from a completely random point and require\nmany iterations to reach a good point. 6.5 TFGNNs are Robust to Feature Noise\nAs TFGNNs use both node features and label information while traditional GNNs rely only on node features, we expect that\nTFGNNs are more robust to feature noise than traditional GNNs. Gaussian noise with\nstandard deviation σto the node features and evaluate the accuracy of the models. We train TFGNNs and GCNs with the Cora\ndataset. TFGNNs are more robust to feature noise especially in high noise regimes where the\nperformance of GCNs degrades significantly. Gaussian noise to the\nnode features than traditional GNNs. This technique was also used by Addanki et al. However, the focus is different, and there are different points between\nthis work and theirs. We propose the training-free + optional training framework for the first time. The notable characteristics of\nGNNs are (i) TFGNNs receive both original features and LaF, (ii) TFGNNs can be deployed without training, and (iii) TFGNNs can\nbe improved with optional training. The key idea is to use randomly\ninitialized fixed weights for aggregation. The main difference is that graph echo state networks still require to train the output layer,\nwhile TFGNNs can be used without training. These methods are orthogonal, and it is an interesting direction to combine them to\nfurther improve the performance. It samples a\nfixed number of neighbors for each node and aggregates the features of the sampled neighbors. An alternative sampling method is\nlayer-wise sampling introduced in FastGCN. further improved FastGCN by using an adaptive node sampling technique\nto reduce the variance of estimators. LADIES combined neighbor sampling and layer-wise sampling to take the best of both worlds. GraphSAINT samples\nsubgraphs by random walks for each mini-batch. It should also be noted that general techniques to speed up neural networks, such as mixed-precision training, quantization, and\npruning can be applied to GNNs. These methods mitigate the training cost of GNNs, but they still require many training iterations. In this paper, we propose\ntraining-free GNNs, which can be deployed instantly as soon as the model is initialized. Besides, our method can be improved with\noptional training. In the optional training mode, the speed up techniques mentioned above can be combined with our method to\nreduce the training time further. If GNNs cannot represent the true function, we cannot expect GNNs to\nwork well however we train them. First, LaF and TFGNNs cannot be applied to inductive settings while most GNNs can. Popular GNNs such as GCNs and GATs are applicable to both transductive and inductive settings and\nare often used for transductive settings. However, this also means that they do not take advantage of transductive-specific structures\n(those that are not present in inductive settings). We believe that it is important to exploit inductive-specific techniques for inductive\nsettings and transductive-specific techniques (such as LaF) for transductive settings in order to pursue maximum performance. Second, TFGNNs cannot be applied to heterophilious graphs, or its performance degrades as TFGNNs are based on label propagation. The same argument mentioned above applies. Relying on homophilious graphs is not a negative point in pursuing maximum\nperformance. (19) – (29) meet the requirementsarticle graphicx\n7",
        "Results and Findings": "The design of TFGNNs is based on these findings. Empirical evaluations show that TFGNNs surpass current GNNs in scenarios where training is not performed, and\nwhen training is optionally applied, they achieve convergence much faster than conventional GNNs. Several GNN architectures, including Graph Convolutional\nNetworks (GCNs) and Graph Attention Networks (GATs), have successfully addressed transductive node classification, yielding\nexcellent results. Processing these massive\ngraphs can be computationally prohibitive. Our experiments confirm that TFGNNs surpass existing GNNs when used without training and achieve convergence significantly\nfaster than traditional GNNs when training is applied. **Output:** Predicted labels Ytest∈YVtestfor the remaining nodes\nVtest=V\\Vtrain . Specifically, we show that GNNs utilizing LaF can effectively represent the label propagation algorithm, a crucial method\nfor transductive node classification, whereas GNNs without LaF cannot achieve this. This finding is significant in its own right and\nprovides a strong motivation for the design of TFGNNs. Label propagation is a well-established method for transductive node classification. Specifically, there exists a series of\nGNNs {f(l)\nagg}landfpred such that for any positive ϵ, for any connected graph G= (V, E, X ), for any labeled nodes Vtrain⊂Vand\nnode labels Ytrain∈YVtrain, and test node v∈V\\Vtrain , there exists L∈Z+such that the l(≥L)-th GNN ( f(1)\nagg, ..., f(l)\nagg, fpred)\nwith LaF outputs an approximation of label propagation with an error of at most ϵ, i.e.,\n||ˆyv−ˆyLP\nv||1< ϵ,\nwhere ˆyLP\nvis the output of label propagation for test node v. Ifv∈Vtrain ,f(l)\naggoutputs 1[i=yv],\ncomputable from ˜yvinh(l−1)\nv . As the second term converges to zero as lincreases, GNNs can approximate label propagation with arbitrary precision by increasing\nl.\nWe then show that GNNs without LaF cannot represent label propagation. Specifically, for any series of GNNs {f(l)\nagg}land\nfpred, there exists a positive ϵ, a connected graph G= (V, E, X ), labeled nodes Vtrain⊂V, node labels Ytrain∈YVtrain, and a\ntest node v∈V\\Vtrain , such that for any l, the GNN ( f(1)\nagg, ..., f(l)\nagg, fpred) without LaF has an error of at least ϵ, i.e.,\n3||ˆyv−ˆyLP\nv||1> ϵ,\nwhere ˆyLP\nvis the output of label propagation for test node v. These results indicate that\nGNNs with LaF are more powerful than traditional message-passing GNNs like GCNs, GATs, and GINs without LaF. These findings highlight the importance of considering both the\ninput and the architecture of GNNs to maximize their expressive power. (8), and\nargmaxiˆyv,i=argmaxipL,v,i\nholds, and pL,v,i→ˆyLP\nv,iasL→ ∞ . (9) – (13). 6.2 TFGNNs Outperform Existing GNNs in Training-free Setting\nWe compare the performance of TFGNNs with GCNs and GATs in the training-free setting by assessing the accuracy of the models\nwhen the parameters are initialized. The results are shown in Table 1. TFGNNs outperform GCNs and GATs in all the datasets. These\nresults validate that TFGNNs meet the definition of training-free models. We can also observe that GCNs, GATs, and TFGNNs do\nnot benefit from LaF in the training-free settings if randomly initialized. These results indicate that both LaF and the initialization of\nTFGNNs are important for training-free performance. The best results are shown in bold. TFGNNs outperform GCNs and GATs in all the datasets. These results indicate that TFGNNs are training-free. Cora CiteSeer PubMed CS Physics Computers\nGCNs 0.163 0.167 0.180 0.079 0.101 0.023\nGCNs + LaF 0.119 0.159 0.407 0.080 0.146 0.061\nGATs 0.177 0.229 0.180 0.040 0.163 0.058\nGATs + LaF 0.319 0.077 0.180 0.076 0.079 0.025\nTFGNNs + random initialization 0.149 0.177 0.180 0.023 0.166 0.158\nTFGNNs (proposed) 0.600 0.362 0.413 0.601 0.717 0.730\n6.3 Deep TFGNNs Perform Better in Training-free Setting\nWe confirm that deeper TFGNNs perform better in the training-free setting. Proposition 5.2 shows that the initialized TFGNNs converge to label propagation as the\ndepth goes to infinity, and we expect that deeper TFGNNs perform better in the training-free setting. We train the models with three random seeds and report the\naverage accuracy and standard deviation. We can also observe that fully trained TFGNNs perform on par with GCNs. These results\nindicate that TFGNNs enjoy the best of both worlds: TFGNNs perform well without training and can be trained faster with optional\ntraining. The results are shown in Figure 4. These results indicate that TFGNNs are more robust to i.i.d. and analyzed by Wang et al. Besides, we provide detailed analysis and experiments including the speed of convergence and\nnoise robustness. Our results provide complementary insights to the existing works. Huang et al. ClusterGCN uses a cluster of nodes as a mini-batch. Sato and Loukas\nshowed that message-passing GNNs are as powerful as a computational model of distributed local algorithms, and they proposed\nGNNs that are as powerful as port-numbering and randomized local algorithms. 6We contributed to the field of the expressive power of GNNs by showing that GNNs with LaF are more powerful than GNNs without\nLaF. This result indicates that it is important to consider what to input to the GNNs as well as the\narchitecture of the GNNs for the expressive power of GNNs.",
        "Conclusion": "Our analysis demonstrates that incorporating labels as features\nsignificantly improves the representational capacity of GNNs. We establish that incorporating labels as features demonstrably augments the expressive capability of GNNs. * We provide formal proof that LaF enhances\nthe representational power of GNNs. 4 LaF Strengthens the Expressive Power of GNNs\nWe demonstrate that incorporating labels as features (LaF) provably enhances the expressive capabilities of Graph Neural Networks\n(GNNs). **Proof. The final output of the GNN is pl,v,i. **Proof. **Proof. Therefore,\n4h(L)\nv,−(|Y|−i+1)=pL,v,i\nholds. We confirm this in this section. We add i.i.d. and\nXu et al. showed that message-passing GNNs are at most as powerful as the 1-WL test, and they proposed k-GNNs and GINs, which\nare as powerful as the k-(set)WL and 1-WL tests, respectively. Loukas showed that GNNs are Turing-complete\nunder certain conditions (i.e., with unique node ids and infinitely increasing depths). Specifically, we showed that GNNs with LaF can represent an important model, label propagation, while GNNs without LaF\ncannot. Finally, we did not explore applications of LaF other than TFGNNs. 9 Conclusion\nIn this paper, we made the following contributions. * We formally showed that LaF strengthens the\nexpressive power of GNNs (Section 4). * We showed that GNNs with LaF can represent label propagation (Theorem 4.1) while\nGNNs without LaF cannot (Proposition 4.2). * We\nshowed that TFGNNs defined by Eqs.",
        "label": "Non-Publishable",
        "Reasons": {
            "Abstract": [
                "No theoretical backing or proofs."
            ],
            "Methodology": [
                "No comparison with ongoing methods of this field."
            ],
            "Results and Findings": [
                "Lacks experimental evidence, test data.",
                "Lacks real-world applicability."
            ]
        }
    },
    {
        "Abstract": "Collaborative Clothing Segmentation and\nIdentification Through Image Analysis\nAbstract\nThis research introduces a comprehensive clothing co-parsing system designed\nto analyze a collection of clothing images, which are unsegmented but include\ndescriptive tags. The objective is to optimize parameters by maximizing the posterior probability:\n{L∗, R∗, W∗, C∗}= arg max P(L, R, W, C |I)\nThis probability can be factorized into co-labeling and co-segmentation components:\nP(L, R, W, C |I)∝P(L|R, C)×NY\ni=1P(Ri|Ci, Ii)P(Wi|Ri)P(Ci|Wi, Ii)\nThe optimization process involves two phases: clothing image co-segmentation and co-labeling. Coherent regions are selected to train E-SVMs by maximizing P(W|R):\nP(W|R) =Y\nkP(wk|rk)∝Y\nkexp{−E(wk, rk)−ϕ(rk)}\nwhere ϕ(rj)indicates whether rjhas been chosen for training E-SVM, and E(wk, rk)is the convex\nenergy function of E-SVM.",
        "Methodology": "The proposed method uses a two-stage, data-driven approach. The first\nstage, termed \"image co-segmentation,\" iteratively refines image regions, using\nthe exemplar-SVM (E-SVM) method to enhance region consistency across images. The system’s performance is tested on the\nFashionista dataset and a newly developed dataset called CCP, which contains 2098\nhigh-resolution street fashion images. However, image-level tags from user data offer a viable alternative. This paper focuses\non the development of a system to segment clothing images and assign semantic labels to these\nsegments. The main contribution of this work is an effective system for parsing groups of clothing images and\nproviding precise pixel-level annotations. The system addresses the following significant challenges:\n•Clothes exhibit a wide variety of styles and textures, making them difficult to segment and\nidentify using only basic visual features. •Variations in human poses and the way clothes can obscure themselves complicate the\nrecognition process. It also utilizes contextual cues related to how clothing items are typically arranged\nand related to each other. The co-segmentation phase refines regions across images using the E-SVM method. Initially, images\nare divided into superpixels, which are then grouped into regions. However, certain stable regions are\nidentified based on criteria like size and position. E-SVM classifiers are trained for these selected\nregions using HOG features, creating region-based detectors that help identify similar regions across\nimages. This approach is based on the observation that similar clothing items often share visual\npatterns. The co-labeling phase uses a data-driven approach, constructing a multi-image graph where regions\nare treated as nodes. Connections are made between adjacent regions within an image, as well as\nbetween regions in different images that share visual or tag similarities. The optimization is performed\nusing the Graph Cuts algorithm, considering various clothing context constraints. Subsequent studies explored blocking\nmodels for segmenting clothes in images where items were heavily obscured, and deformable spatial\nmodels to enhance segmentation accuracy. However,\nthese methods have not been applied to clothing co-parsing and typically demand significant labeling\neffort. Methods include unsupervised shape-guided approaches for single-\ncategory co-labeling and incorporating automatic image segmentation with spatially coherent latent\ntopic models for unsupervised multi-class labeling. These unsupervised methods can struggle with a\nlarge number of categories and diverse appearances. Recent efforts have focused on supervised label\npropagation, using pixel-level label maps to assign labels to new images. However, these methods are\noften limited by the need for detailed annotations and rely on pixel-level correspondences, which\nmay not be effective for clothing parsing. 3 Methodology\nThis research introduces a probabilistic model for the co-parsing of clothing images. (c) E-SVM weights wktrained for each selected region. 2In the co-segmentation phase, optimal regions are obtained by maximizing P(R|C, I). , K }is introduced, indicating the region to which superpixel sj\nbelongs. Each region rkis defined as rk={sj|oj=k}. The probability P(R|C, I)is defined as:\nP(R|C, I) =Y\ni\nP(ri|C, I)Y\nsj∈IiP(oj|C, Ii)Y\n(m,n )P(om, on, sm, sn|C)\n\nThe unary potential P(oj, sj)indicates the probability of superpixel sjbelonging to a region, and the\npairwise potential P(om, on, sm, sn|C)encourages smoothness between neighboring superpixels. 3.1 Unsupervised Image Co-Segmentation\nThe co-segmentation process involves iteratively refining regions, E-SVM weights, and segmentation\npropagations. Training E-SVMs: The energy function for training E-SVMs is:\nE(wk, rk) =λ1\n2||wk||2+X\nsj∈rkmax(0 ,1−wT\nkf(sj)) +λ2X\nsn∈NEmax(0 ,1 +wT\nkf(sn))\nSegmentation Propagation: The E-SVM response is calibrated using a logistic distribution:\nSE(f;w) =1\n1 + exp( −αE(wTf−βE))\n3.2 Contextualized Co-Labeling\nIn this phase, a multi-image graphical model connects all images, incorporating two types of clothing\ncontexts. The framework includes a new dataset of high-resolution street fashion photos with detailed\nannotations. Future work will focus on improving inference by iterating between\nthe two phases and exploring parallel implementations for large-scale applications.",
        "Results and Findings": "The system aims to segment these images into meaningful config-\nurations. The results show a segmentation accuracy of\n90.29% and 88.23% and a recognition rate of 65.52% and 63.89% on the Fashion-\nista and CCP datasets, respectively, demonstrating an improvement over current\nleading methods. This strategy allows for\ncollective label assignment, leveraging similarities across images. Recent approaches have used shape-based human models\nor combined pose estimation with supervised region labeling, achieving notable results. . . . . The interior affinity model is:\nP(ℓim, ℓin, rm, rn) =ϕ(ℓim, ℓin, rm, rn)·U(ℓim, ℓin)\nand the exterior affinity model is:\nQ(ℓiu, ℓiv, ru, rv|C) =Gℓiu(Xu)·Gℓiv(Xv)·ϕ(ℓiu, ℓiv, ru, rv)\n34 Experiments\nThe framework is evaluated on two datasets: Clothing Co-Parsing (CCP) and Fashionista. Table 1: Clothing parsing results (%) on the Fashionista and CCP datasets. 2*Methods Fashionista CCP\naPA mAGR aPA mAGR\nOurs-full 90.29 65.52 88.23 63.89\nPECS 89.00 64.37 85.97 51.25\nBSC 82.34 33.63 81.61 38.75\nSTF 68.02 43.62 66.85 40.70\nOurs-1 89.69 61.26 87.12 61.22\nOurs-2 88.55 61.13 86.75 59.80\nOurs-3 84.44 47.16 85.43 42.50\nBaseline 77.63 9.03 77.60 15.07\nThe proposed method outperforms BSC, STF, and PECS on both datasets, demonstrating the effec-\ntiveness of the iterative co-segmentation and co-labeling phases. The experiments show that the proposed method is effective and performs favorably\ncompared to existing methods.",
        "Conclusion": ", K . Finally, P(Ci|Wi, Ii)is defined based on the responses of E-SVM classifiers, maximized by selecting\nthe top kdetections of each E-SVM as segmentation propagations. 5 Conclusion\nThis paper presents a framework for jointly parsing a collection of clothing images using image-level\ntags. 4",
        "label": "Non-Publishable",
        "Reasons": {
            "Methodology": [
                "Uses existing techniques.",
                "Lacks real-world scenario."
            ],
            "Results and Findings": [
                "Less test cases, datasets.",
                "No comparison with existing methods.",
                "No statistical analysis."
            ],
            "General": [
                "Lack of clear explanation, repetitive text."
            ]
        }
    },
    {
        "Abstract": "High-Throughput Genomic Sequencing in Marine\nEcology: Unveiling the Mysteries of the Ocean’s\nGenetic Diversity\nAbstract\nHigh-Throughput Genomic Sequencing in Marine Ecology has revolutionized our\nunderstanding of the complex interactions within marine ecosystems, enabling the\nexamination of genomic material from a vast array of organisms, from plankton to\nlarge marine mammals, and shedding light on the intricate relationships between\nspecies, their environments, and the impacts of human activities.",
        "Methodology": "This approach,\ncombining advanced sequencing technologies with sophisticated computational\ntools, allows for the rapid and comprehensive analysis of genomic data, uncovering\nnew insights into the biodiversity, ecological roles, and evolutionary histories\nof marine organisms. Moreover, the application of high-throughput sequencing\nto marine environmental DNA (eDNA) offers a novel method for monitoring\nmarine biodiversity and tracking changes in ecosystem composition over time,\nwhich is crucial for conservation efforts and the management of marine resources. This novel approach, while unorthodox, provided a unique\nlens through which to view genomic data, highlighting the complex interplay\nbetween genetic and environmental factors in shaping the evolution and diversity\nof marine life. Further, the integration of artificial intelligence algorithms with\ngenomic sequencing data enabled the prediction of previously unknown species\nbased on patterns identified in the genetic material of well-studied organisms,\nleading to a significant expansion of known marine biodiversity. One of the most striking aspects of High-Throughput Genomic Sequencing in Marine Ecology is its\npotential to reveal the hidden patterns and structures that govern the behavior of marine ecosystems.By analyzing the genomic signatures of marine organisms, researchers can identify the subtle cues and\nsignals that trigger complex behaviors, such as the migratory patterns of sea turtles or the schooling\nbehaviors of fish. Furthermore, the integration of genomic data with other types of data, such as\nenvironmental sensors and remote sensing imagery, has enabled the development of sophisticated\nmodels that can predict the responses of marine ecosystems to environmental perturbations, such as\nclimate change or ocean acidification. Furthermore, the integration of high-throughput sequencing with other omics approaches, such as\ntranscriptomics and proteomics, has provided a more comprehensive understanding of the molecular\nmechanisms underlying marine ecological processes. Moreover, some researchers have taken a more unconventional approach to the analysis of genomic\ndata in marine ecology, using techniques such as machine learning and artificial intelligence to\nidentify patterns and relationships in the data that may not be immediately apparent through traditional\nanalytical methods. Another study\nused a decision tree approach to classify marine microbial communities based on their genomic\ncomposition, and discovered that certain communities were associated with specific environmental\nparameters, such as temperature and salinity. In a rather unexpected twist, some researchers have also explored the use of high-throughput se-\nquencing to study the genomic composition of marine organisms that have been exposed to music\nand other forms of sound. The use of high-throughput sequencing in marine ecology has also been influenced by the development\nof new technologies and methodologies, such as single-cell genomics and long-range sequencing. These approaches have enabled researchers to analyze the genomes of individual cells and to assemble\ncomplete genomes from fragmented DNA sequences, providing a more detailed understanding of the\ngenomic diversity of marine organisms. Additionally, the development of new computational tools\nand software has facilitated the analysis of large genomic datasets, enabling researchers to identify\npatterns and relationships in the data that may not be immediately apparent through traditional\nanalytical methods. As the field continues to evolve, it is likely that new and\ninnovative approaches will be developed, enabling researchers to explore the genomic diversity\nof marine organisms in even greater detail and to address some of the most pressing questions in\nmarine ecology. 3 Methodology\nHigh-throughput genomic sequencing has revolutionized the field of marine ecology by enabling\nthe analysis of vast amounts of genomic data from diverse marine organisms. Our approach involved the collection of marine samples from various locations around the world,\nincluding coral reefs, deep-sea trenches, and coastal ecosystems. We then extracted genomic DNA\nfrom these samples using a novel protocol involving the use of dolphin-friendly sonication and\nenzymatic lysis. The extracted DNA was subsequently subjected to library preparation using a custom-designed\nprotocol that incorporated elements of chaos theory and fractal geometry. This unconventional\napproach allowed us to capture a wider range of genomic diversity and complexity in our samples. We also incorporated a novel quality control step involving the use of artificial intelligence-powered\noctopuses, which were trained to detect and remove any contaminants or artifacts from the sequencing\n3libraries. This innovative approach resulted in a significant improvement in the overall quality and\naccuracy of our sequencing data. In addition to these conventional sequencing approaches, we also explored the use of alternative\nmethods, including the deployment of underwater sequencing drones and the incorporation of\nseaweed-based sequencing matrices. The seaweed-based sequencing matrices, on the\nother hand, enabled us to sequence genomic data from marine organisms in their natural habitats,\nwithout the need for laboratory-based processing. Our sequencing data were then analyzed using a combination of bioinformatic tools and machine\nlearning algorithms, including a custom-designed program called \" MarineGenomeMiner.\" Furthermore, we incorporated a range of unusual and unorthodox methods into our analytical pipeline,\nincluding the use of tarot cards, astrological charts, and interpretive dance. These approaches, which\nwere designed to capture the intuitive and creative aspects of genomic analysis, allowed us to identify\nnovel patterns and relationships in the data that would have been missed by conventional methods. Overall, our approach to high-throughput genomic sequencing in marine ecology has been highly\ninnovative and unconventional, incorporating a range of cutting-edge technologies, unusual methods,\nand unorthodox analytical approaches. 4 Experiments\nTo investigate the intricacies of high-throughput genomic sequencing in marine ecology, a com-\nprehensive experimental framework was devised, incorporating both conventional and unorthodox\nmethodologies. These samples were then subjected to high-throughput genomic\nsequencing using cutting-edge technologies, including but not limited to, Illumina NovaSeq and\nOxford Nanopore MinION. The sequencing data were subsequently analyzed through a bespoke\npipeline that integrated traditional bioinformatics tools with an unconventional approach involving\nthe application of chaos theory principles to identify potential genomic patterns that may not be\napparent through conventional analysis. In an unexpected turn, the research team decided to incorporate an innovative, albeit somewhat\ncontroversial, method involving the use of Artificial Intelligence (AI) generated \"imaginary\" genomes. Samples of seawater containing a diverse array of marine life were\nexposed to different genres of music, ranging from classical to heavy metal, and the changes in their\n4genomic expression were monitored. To further elucidate the complex interactions between marine organisms and their environment, the\nresearch team conducted a series of experiments involving the co-cultivation of different marine\nspecies under controlled laboratory conditions. The experimental design also incorporated a unique approach to data analysis, which involved the\nuse of fractal geometry to visualize and interpret the genomic data. This approach revealed intricate\npatterns and structures within the genomic data that were not apparent through traditional analysis,\nproviding new insights into the organization and evolution of genomes in marine organisms. In addition to these experiments, the research team also explored the potential applications of high-\nthroughput genomic sequencing in marine ecology, including the monitoring of marine biodiversity,\nthe detection of invasive species, and the development of novel conservation strategies. The following table summarizes the key findings of the experiments: Overall, the experiments\nTable 1: Summary of Experimental Findings\nExperiment Methodology Key Findings\nSeawater Sampling High-throughput genomic sequencing Genetic diversity of marine organisms\nAI-generated Genomes Chaos theory-based analysis Genomic plasticity and adaptability\nMusic Exposure Genomic expression analysis Impact of music on genomic expression\nFormaldehyde Preservation High-throughput genomic sequencing Genomic mutations induced by preservation\nCo-cultivation Experiments Controlled laboratory conditions Emergence of novel genomic traits\nFractal Geometry Analysis Fractal-based data visualization Intricate patterns in genomic data\ndemonstrated the power and versatility of high-throughput genomic sequencing in marine ecology,\nhighlighting its potential to reveal new insights into the genomic underpinnings of marine organisms\nand to inform novel conservation strategies. The incorporation of unconventional methodologies and\nanalyses added a unique dimension to the research, revealing unexpected patterns and correlations\nthat warrant further investigation. As the field of marine ecology continues to evolve, the integration\nof high-throughput genomic sequencing with innovative methodologies and analyses is likely to play\nan increasingly important role in advancing our understanding of the complex interactions between\nmarine organisms and their environment. Our study employed a combination of shotgun metagenomics and 16S\n5rRNA gene sequencing to characterize the microbial communities associated with various marine\nspecies, including corals, sponges, and fish. To further investigate the properties of marine extremophiles, we conducted a series of experiments\nin which we exposed these microorganisms to various environmental stresses, including high temper-\natures, high salinity, and intense radiation. Further research is needed to fully explore the properties and potential applications of\nthese remarkable microorganisms, and to understand the complex interactions between microorgan-\nisms and their environments in marine ecosystems. Furthermore, the incorporation of\nbizarre approaches, such as the utilization of chaotic fractal theory to quantify cognitive load, may\nprovide novel insights into the underlying mechanisms governing human-vehicle interaction. By\nembracing such unconventional methods, researchers may uncover previously unknown patterns and\nrelationships that can inform the design of more intuitive and user-centered autonomous car cockpits. The long-term implications of this research are profound, with the potential to revolutionize\nthe way we design and interact with autonomous vehicles, and to create a new era of transportation\nthat is characterized by increased safety, sustainability, and user satisfaction. As we move forward in\nthis exciting and rapidly evolving field, it is crucial to remain open to new ideas and approaches, even\nif they seem bizarre or unconventional at first, for it is often the most innovative and outside-the-box\nthinking that leads to the most significant breakthroughs and advancements.",
        "Results and Findings": "Moreover, the application of High-Throughput Genomic\nSequencing has facilitated the discovery of novel genes, genomes, and metabolic pathways, shedding\nlight on the vast array of biochemical processes that underpin the remarkable diversity of marine life. While this idea may seem fanciful, it has\nbeen supported by a number of intriguing studies that have demonstrated the ability of sound waves\nto alter the expression of genes and modify the structure of genomes in marine organisms. The application of High-Throughput Genomic Sequencing in Marine Ecology has also led to some\nunexpected and counterintuitive findings, such as the discovery that certain species of seaweed may\nbe capable of \"stealing\" genes from nearby organisms and incorporating them into their own genomes. Others have used genomic sequencing to identify\nthe genetic basis of \"marine intuition,\" a phenomenon in which experienced sailors and fishermen\nseem to possess an uncanny ability to predict the behavior of marine ecosystems and navigate the\ncomplexities of the ocean. This has led to the discovery of novel enzymes,\nbiochemical pathways, and metabolic processes that are unique to marine organisms, and has\nsignificant implications for the development of new biotechnological applications. In a surprising turn of events, some researchers have explored the use of high-throughput sequencing to\nstudy the genomic composition of marine organisms that have been exposed to unusual environments,\nsuch as the harsh conditions found in deep-sea hydrothermal vents or the unusual light regimes of\nthe Arctic and Antarctic regions. For example, one study found that the genomes of certain marine\nspecies that inhabit these environments contain a higher proportion of genes involved in DNA repair\nand antioxidant defenses, suggesting that these organisms have evolved unique mechanisms to cope\n2with the extreme conditions. For instance, one study used a neural network algorithm to predict the presence\nof certain marine species based on their genomic characteristics, and found that the algorithm was\nable to identify species that were not previously known to exist in the study area. For example, one study found that the genomes of certain marine species\nthat were exposed to classical music contained a higher proportion of genes involved in cell growth\nand division, suggesting that music may have a positive effect on the health and well-being of these\norganisms. Another study discovered that the microbial communities found in marine environments\nthat are exposed to heavy metal music are capable of producing a wide range of novel bioactive\ncompounds, including antimicrobial peptides and pigments with potential applications in medicine\nand biotechnology. To investigate the\ncomplex relationships between marine species and their environments, we employed a combination\nof cutting-edge sequencing technologies, including Illumina NovaSeq and Oxford Nanopore MinION. The underwater sequencing drones, which were designed to\nresemble giant squids, allowed us to collect and sequence genomic data from remote and inaccessible\nlocations, such as the depths of the Mariana Trench. This\nprogram, which was trained on a dataset of over 10,000 marine genomes, allowed us to identify and\ncharacterize novel genomic features, such as gene clusters and regulatory elements, that are unique to\nmarine organisms. Surprisingly, the inclusion of these imaginary genomes in the analysis\nrevealed intriguing correlations between the genomic makeup of real marine organisms and their\nfictional counterparts, suggesting a previously unknown level of genomic plasticity and adaptability. The results showed that certain genres of music, particularly\nclassical music, had a profound impact on the genomic expression of some marine organisms, leading\nto increased expression of genes related to stress resilience and adaptability. This finding, though\nseemingly illogical, opens up new avenues for research into the potential applications of sound\ntherapy in marine conservation. Contrary to expectations, the results showed that these preserved\nspecimens retained a significant amount of intact genomic material, which provided valuable insights\ninto the evolutionary history of these organisms. Moreover, the analysis revealed that the process of\npreservation itself had induced unique genomic mutations that were not observed in fresh samples,\nsuggesting that formaldehyde preservation may have unintended consequences on the genomic\nintegrity of biological specimens. The results showed that certain combinations of\nspecies led to the emergence of novel genomic traits that were not observed in individual species,\nhighlighting the importance of interspecies interactions in shaping the genomic landscape of marine\necosystems. The results\nshowed that high-throughput genomic sequencing has the potential to revolutionize the field of marine\necology, enabling researchers to gain a deeper understanding of the complex interactions between\nmarine organisms and their environment, and to develop more effective conservation strategies. The results of our analysis revealed a remarkable diversity\nof microbial taxa, with many previously unknown species being identified. Notably, we observed a\nsignificant correlation between the composition of the microbial community and the host organism’s\ndiet, with herbivorous species exhibiting a greater abundance of algae-associated microbes. One of the most intriguing findings of our study was the discovery of a novel group of microorganisms\nthat appear to be capable of surviving in extreme environments, including high-salinity and high-\ntemperature conditions. These microorganisms, which we have termed \"marine extremophiles,\" were\nfound to be highly abundant in certain marine ecosystems, such as hydrothermal vents and salt lakes. Further analysis revealed that these microorganisms possess a unique set of genes that enable them to\nwithstand extreme conditions, including genes involved in DNA repair, antioxidant production, and\nmembrane stabilization. In addition to their remarkable survival capabilities, our results suggest that marine extremophiles\nmay also play a crucial role in the marine ecosystem. We observed that these microorganisms are\ncapable of producing a wide range of bioactive compounds, including antibiotics, antivirals, and\nanticancer agents. Interestingly, we also found that\nmarine extremophiles are able to communicate with each other through a complex system of chemical\nsignals, which may enable them to coordinate their behavior and work together to achieve common\ngoals. The results of these experiments were surprising, as we\nfound that marine extremophiles are not only able to survive in extreme conditions but also appear\nto thrive in these environments. In fact, we observed that the growth rate of marine extremophiles\nincreased significantly when they were exposed to high temperatures and high salinity, suggesting\nthat these microorganisms may be capable of exploiting these conditions to their advantage. Interestingly, we also observed that the microbial\ncommunity composition in different marine ecosystems is correlated with the local cuisine of the\nnearest human population, with a significant increase in the abundance of microorganisms associated\nwith spicy food in ecosystems near regions with high consumption of spicy dishes. 7",
        "Conclusion": "5 Results\nHigh-throughput genomic sequencing has revolutionized the field of marine ecology, enabling\nresearchers to investigate the complex interactions between marine organisms and their environments\nat an unprecedented scale. In conclusion, our study has revealed a fascinating world of microbial diversity in marine ecosystems,\nwith many surprises and unexpected findings. 66 Conclusion\nIn conclusion, the integration of cognitive load modeling in autonomous car cockpits has far-reaching\nimplications for the future of transportation, necessitating a multidisciplinary approach that reconciles\nthe complexities of human cognition with the rapid advancements in autonomous vehicle technology.",
        "label": "Publishable",
        "Reasons": {}
    },
    {
        "Abstract": "Joint Syntacto-Discourse Parsing and the\nSyntacto-Discourse Treebank\nAbstract\nDiscourse parsing has long been treated as a stand-alone problem independent from\nconstituency or dependency parsing. In\nother words, quite shockingly, no tree structure is represented anywhere in the parser. Again, it\nis important to note that no discourse or syntactic tree structures are represented in the features.",
        "Methodology": "In this paper we propose the first end-to-end discourse\nparser that jointly parses in both syntax and discourse levels, as well as the first\nsyntacto-discourse treebank by integrating the Penn Treebank with the RST Tree-\nbank. Built upon our recent span-based constituency parser, this joint syntacto-\ndiscourse parser requires no preprocessing whatsoever (such as segmentation or\nfea- ture extraction), achieves the state-of-the- art end-to-end discourse parsing\naccuracy. We argue for the first time that discourse parsing should be viewed as an extension of, and be\nperformed in conjunction with, constituency parsing. We propose the first joint syntacto-discourse\ntree- bank, by unifying constituency and discourse tree representations. Based on this, we propose\nthe first end-to-end incremental parser that jointly parses at both constituency and discourse levels. Our algo- rithm builds up on the span-based parser; it employs the strong general- ization power\nof bi-directional LSTMs, and parses efficiently and robustly with an extremely simple span-based\nfeature set that does not use any tree structure information. We make the following contributions:\n1.We develop a combined representation of constituency and discourse trees to facilitate\nparsing at both levels without explicit conver- sion mechanism. We propose a novel joint parser that parses at both constituency and discourse levels. When the gold EDUs are pro- vided, our parser is also competitive to other existing\napproaches with sophisticated fea- tures. Most of the internal tree nodes are binary\nbranching, with one nucleus child containing the core semantic meaning of the current node, and\none satellite child semantically decorating the nucleus. Like dependency labels, there is a relation\nannotated between each satellite-nucleus pair, such as “Background” or “Purpose”. While these previous approaches rely on pre-trained tools to provide both EDU\nsegmentation and intra-EDU syntactic parse trees, we in- stead propose to directly determine the\nlow-level segmentations, the syntactic parses, and the high- level discourse parses using a single joint\nparser. This parser is trained on the combined trees of constituency and discourse structures. We first convert an RST tree to a format similar to those constituency trees in the Penn Treebank. For\neach binary branching node with a nucleus child and a satellite child, we use the relation as the label\nof the converted parent node. The nucleus/satellite relation, along with the direction (either ←or→,\npointing from satellite to nucleus) is then used as the label. After converting an RST tree into the constituency tree format, we then replace each leaf node (i.e.,\nEDU) with the corresponding syntactic (sub)tree from PTB. Given that the sentences in the RST\nTreebank is a subset of that of PTB, we can always find the corresponding constituency subtrees for\neach EDU leaf node. E.g., if C–D is one EDU\nin the PTB tree A it might be converted to Purpose →DCB A based on the Penn Treebank and RST\nTreebank. This PTB-RST treebank is released as a set of tools to generate the joint trees given Penn\nTree- bank and RST Treebank data. During the align- ment between the RST trees and the PTB trees,\nwe only keep the common parts of the two trees. We follow the standard training/testing split of the RST Treebank. In the training set, there are 347\njoint trees with a total of 17,837 tokens, and the lengths of the discourses range from 30 to 2,199\ntokens. In the test set, there are 38 joint trees with a total of 4,819 tokens, and the lengths vary from\n45 to 2,607. 3 Joint Syntacto-Discourse Parsing\nGiven the combined syntacto-discourse treebank, we now propose a joint parser that can perform\nend-to-end discourse segmentation and parsing. 3.2 Joint PTB-RST Treebank\nUsing the conversion strategy described above we build the first joint syntacto-discourse treebank. Notice that in conventional\nincremental parsing, the stack stores the subtrees constructed so far, but in span-based constituency\nparsing, the stack only stores the boundaries of subtrees, which are just a list of indices ...i k j. But different from previous work, after a\nstructural action, we choose to keep the last branching point k, i.e., i k j (mostly for combine, but also\ntrivially for shift). This is because in our parsing mechanism, the dis- course relation between two\nEDUs is actually de- termined after the previous combine action. We need to keep the splitting point\nto clearly find the spans of the two EDUs to determine their relations. This midpoint k disappears\nafter a label ac- tion; therefore we can use the shape of the last span on the stack (whether it contains\nthe split point, i.e., i k j or i j) to determine the par- ity of the step and thus no longer need to carry the\nstep z in the state . This greatly simplifies the pre- processing and post-processing efforts needed. During the decoding time, a document is first passed into a two-layer bi-directional LSTM model,\nthen the outputs at each text position of the two layers of the bi-directional LSTMs are con- catenated\nas the positional features. The spans at each parsing step can be represented as the fea- ture vectors\nat the boundaries. The span features are then passed into fully connected networks with softmax to\ncalculate the likelihood of performing the corresponding action or marking the cor- responding label. We use the “training with exploration” strategy and the dynamic oracle mechanism to make sure the\nmodel can handle unseen parsing configurations properly. We randomly choose 30\ndocuments from the training set as the development set. We tune the hyperparameters of the neural model on the development set. To alleviate the overfitting problem\nfor training on the relative small RST Treebank, we use a dropout of 0.5. 3One particular hyperparameter is that we use a value to balance the chances between training\nfollowing the exploration (i.e., the best action cho- sen by the neural model) and following the correct\npath provided by the dynamic oracle. Since our parser essentially performs both constituency parsing task and discourse parsing task. We\nalso evaluate the performances on sentence constituency level and discourse level separately. On the other hand, the majority of the conven- tional discourse parsers are not end-to-end: they rely\non gold EDU segmentations and pre-trained tools like Stanford parsers to generate features. We\nperform an experiment to compare the per- formance of our parser with them given the gold EDU\nsegments (Table 3). Note that our parser predicts solely\nbased on the span features from bi-directionaly LSTM, instead of any explicitly designed syntactic\nfeatures. To our best knowledge, this is the first end-to-end parser for discourse parsing task. 4Our parser achieves the state-of-the-art per- formance in end-to-end parsing, and unlike previ- ous\napproaches, needs little pre-processing effort.",
        "Results and Findings": "But most of them suffer from the following\nlimitations:\n1.pipelined rather than end-to-end: they assume pre-segmented discourse, and worse yet, use\ngold-standard segmentations\n2. not self-contained: they rely on external syntactic parsers and pretrained word vectors;\n3. complicated: they design sophisticated features, including those from parse-trees. 3.Even though it simultaneously performs con- stituency parsing, our parser does not use any\nexplicit syntactic feature, nor does it need any binarization of discourse trees, thanks to the\npowerful span-based framework.4.Empirically, our end-to-end parser outperforms the existing pipelined discourse pars- ing\nefforts. 2.1 Review: RST Discourse Structures\nIn an RST discourse tree, there are two types of branchings. 2.2 Syntacto-Discourse Representation\nIt is widely recognized that lower-level lexical and syntactic information can greatly help determin-\ning both the boundaries of the EDUs (i.e., dis- course segmentation) as well as the semantic relations\nbetween EDUs. Figure 3 shows the distribution of the discourse lengths over the whole dataset, which on\naverage is about 2x of PTB sen- tence length, but longest ones are about 10x the longest lengths in\nthe Treebank. 23.1 Extending Span-based Parsing\nAs mentioned above, the input sequences are sub- stantially longer than PTB parsing, so we choose\nlinear-time parsing, by adapting a popular greedy constituency parser, the span-based constituency\nparser. Prec. Recall F1\nConstituency 87.6 86.9 87.2\nDiscourse 46.5 40.2 43.0\nOverall 83.5 81.6 82.5\nTable 1: Accuracies on PTB-RST at constituency and discourse levels. For most of the hyperpa-\nrameters we settle with the same values sug- gested previously. We find that = 0.8, i.e., following the dynamic oracle with a\nprobability of 0.8, achieves the best performance. Table 2 shows that, in the perspective of end- to-end discourse parsing, our parser first outper- forms\nthe state-of-the-art segmentator, and furthermore, in end-to-end pars- ing, the superiority of our parser\nis more pronounced comparing to the previously best parser. Note that most of these parsers do not handle multi-branching discourse nodes\nand are trained and evaluated on binarized discourse trees, so their performances are actually not\ndirectly comparable to the results we reported. description syntactic feats. segmentation structure +nuclearity +relation\nsegmentation only Stanford 95.1 - - -\nend-to-end pipeline Penn Treebank 94.0 72.3 59.1 47.3\njoint syntactic & discourse parsing - 95.4 78.8 65.0 52.2\nTable 2: F1 scores of end-to-end systems. syntactic feats structure +nuclearity +relation\nhuman annotation - 88.7 77.7 65.8\n6*sparse Penn Treebank 83.0 68.4 54.8\nCharniak (retrained) 82.7 68.4 55.7\nCharniak (retrained) - - 57.3\nStanford 85.7 71.0 58.2\nZPar (retraied) 83.5 68.1 55.1\nStanford 86.0 72.4 59.7\n5*neural 82.4 69.2 56.8\n+ sparse features Stanford 84.0 70.8 58.6\nMALT 80.5 68.6 58.3\n+ sparse features MALT 81.6 71.1 61.8\nspan-based discourse parsing - 84.2 67.7 56.0\nTable 3: Experiments using gold segmentations.",
        "Conclusion": "2. The\nresult is shown in Table 1. 5 Conclusion\nWe have presented a neural-based incremental parser that can jointly parse at both constituency and\ndiscourse levels. 5",
        "label": "Publishable",
        "Reasons": {}
    },
    {
        "Abstract": "Optimized Transfer Learning with Equivariant\nPretrained Models\nAbstract\nThis research investigates the mechanisms behind Chain-of-Thought (CoT) prompt-\ning, a method that enhances language models’ performance on complex reasoning\ntasks by decomposing them into simpler steps. Further research could explore the application of CoT to other model architectures\nand task domains, as well as the development of more sophisticated prompting strategies.",
        "Methodology": "The study focuses on understanding\nhow CoT improves in-context learning of compositional functions, particularly\nmulti-layer perceptrons (MLPs). Our theoretical analysis, supported by extensive empirical evidence, reveals that\nCoT’s efficacy stems from its ability to guide the model towards a more structured\nand interpretable solution space, thereby mitigating the limitations of standard\nin-context learning (ICL). This structured approach allows the model to better\nleverage the information provided in the few-shot examples, resulting in improved\naccuracy and robustness. CoT achieves this enhancement by strategically decomposing complex problems into a sequence\nof simpler, more manageable sub-problems. Our investigation centers on understanding how this\ndecomposition process impacts the model’s learning and reasoning capabilities, particularly within\nthe context of in-context learning (ICL). We focus on compositional functions, using multi-layer\nperceptrons (MLPs) as a representative model architecture, to analyze the effects of CoT on various\naspects of model performance. We hypothesize\nthat by breaking down complex tasks, CoT reduces the number of training examples required to\nachieve a given level of accuracy. This reduction in sample complexity is crucial for efficient training\nand deployment of LLMs, especially when dealing with limited datasets or computationally expensive\ntraining processes. Furthermore, we explore how CoT affects the approximation power of the model,\ninvestigating whether the decomposition process allows the model to learn and represent more\ncomplex functions effectively. Our analysis considers the interplay between the complexity of the\ntarget function, the number of training examples, and the length of the CoT prompts. We investigate whether the structured reasoning facilitated by CoT leads to more efficient\nlearning during pretraining, resulting in models with improved generalization capabilities. Our empirical analysis involves a series of experiments designed to validate these hypotheses. Our theoretical analysis complements the empirical findings, providing a deeper understanding of\nthe mechanisms by which CoT improves LLM performance. We develop a framework that explains\nhow the structured reasoning induced by CoT guides the model towards a more interpretable and\nefficient solution space. This framework helps to clarify why CoT consistently outperforms standard\nICL, particularly on complex tasks requiring multiple reasoning steps. The theoretical insights offer\nvaluable guidance for the design and optimization of CoT prompting strategies, paving the way for\nthe development of more effective and efficient LLM training methods. Our work builds upon this line of research,\nfocusing specifically on the impact of CoT on in-context learning (ICL) of compositional functions,\nparticularly within the context of multi-layer perceptrons (MLPs). This research aims to fill this gap\nby providing a detailed investigation of CoT’s mechanisms and its implications for efficient LLM\ntraining and deployment. We leverage both theoretical and empirical approaches to gain a deeper\nunderstanding of how CoT facilitates the learning of complex functions. The reduction of sample complexity is a crucial aspect of our investigation. Our\nstudy addresses this by conducting extensive experiments to quantify the impact of CoT on sample\ncomplexity, providing quantitative evidence of its efficiency gains. Furthermore, we explore the\nrelationship between CoT prompt length and model performance, investigating the optimal balance\nbetween detailed intermediate steps and computational efficiency. This analysis contributes to the\ndevelopment of more effective and efficient CoT prompting strategies. Our research also delves into the theoretical underpinnings of CoT’s success. We address this by\ndeveloping a theoretical model that explains how CoT guides the model towards a more structured\nand interpretable solution space, leading to improved generalization capabilities. This framework\nprovides a deeper understanding of why CoT consistently outperforms standard ICL, particularly on\ncomplex tasks requiring multiple reasoning steps. The theoretical insights offer valuable guidance for\nthe design and optimization of CoT prompting strategies. While the benefits of pretraining are well-established [7], the specific role of CoT in en-\nhancing pretraining efficiency and generalization remains largely unexplored. Our study investigates\nwhether the structured reasoning facilitated by CoT leads to more efficient learning during pretraining,\nresulting in models with improved generalization capabilities. We posit that the decomposition\ninherent in CoT allows the model to learn more robust and transferable representations, which are\nless susceptible to overfitting and perform better on unseen data. This aspect is crucial for building\nLLMs that can effectively generalize to a wide range of tasks and domains. While many studies have explored CoT in the context of natural\n2language processing tasks, a detailed analysis of its impact on the learning of compositional functions\nwithin a simpler, more controlled setting like MLPs provides valuable insights into the fundamental\nmechanisms underlying CoT’s effectiveness. 3 Methodology\nThis research employs a mixed-methods approach, combining theoretical analysis with empirical\nexperimentation to investigate the mechanisms behind Chain-of-Thought (CoT) prompting. We analyze how this decomposition affects the model’s ability to\nlearn compositional functions, focusing on the impact on sample complexity and approximation\npower. This theoretical analysis involves developing a mathematical model to capture the relationship\nbetween CoT prompt length, function complexity, and model performance. We explore how the\nstructured reasoning induced by CoT guides the model towards a more efficient and interpretable\nsolution space, leading to improved generalization. Our empirical investigation involves a series of experiments designed to validate our theoretical\nhypotheses and quantify the effects of CoT. We use a range of MLP architectures and reasoning tasks\nof varying complexity, systematically varying the number of training examples and the length of the\nCoT prompts. For each experiment, we measure the model’s accuracy and compare the performance\nof CoT prompting against standard ICL. The datasets used in our experiments consist of synthetically generated data designed to represent\ncompositional functions of varying complexity. This allows us to control the complexity of the tasks\nand isolate the effects of CoT from other factors that might influence performance in more complex\nreal-world datasets. The synthetic data is generated using a set of predefined rules, ensuring that the\nfunctions are well-defined and their complexity can be precisely controlled. This approach allows for\na more rigorous and controlled evaluation of CoT’s impact on sample complexity and approximation\npower. We also explore the use of different prompting strategies, varying the level of guidance\nprovided in the CoT prompts and the types of intermediate steps included. We use statistical tests, such as t-tests, to compare\nthe performance of CoT prompting against standard ICL. We inves-\ntigate whether the structured reasoning facilitated by CoT leads to more efficient learning during\npretraining, resulting in models with improved generalization capabilities. This involves comparing\nthe performance of models pretrained with and without CoT on a range of downstream tasks. We\nanalyze the learned representations of the models to understand how CoT influences the model’s\ninternal representations and its ability to generalize to unseen data. This comprehensive approach allows us to gain a deep understanding of CoT’s mechanisms and its\nimplications for efficient and effective LLM training and deployment. We designed experiments to systematically evaluate CoT’s impact on sample\ncomplexity, approximation power, and generalization ability in the context of in-context learning\n(ICL) for multi-layer perceptrons (MLPs) solving compositional functions. Our experiments involved\nvarying the complexity of the target functions, the number of training examples provided, and the\nlength of the CoT prompts. The\nexperiments were conducted using synthetic datasets to ensure controlled evaluation and precise\nmanipulation of function complexity. We generated datasets with varying levels of noise to assess the\nrobustness of CoT under different conditions. As expected, CoT\nconsistently outperformed ICL, requiring significantly fewer examples to achieve the same level of\naccuracy, particularly for more complex functions. This reduction in sample complexity highlights\nCoT’s efficiency in learning from limited data. Excessively long prompts did not always lead to further\nimprovements, indicating a potential trade-off between detail and computational cost. The table shows that CoT consistently improved the model’s ability to\napproximate complex functions, achieving higher accuracy than ICL across all complexity levels. This suggests that CoT facilitates the learning of more intricate relationships within the data, enabling\nthe model to capture the underlying structure of the compositional functions more effectively. The\nimprovement was particularly pronounced for functions requiring multiple reasoning steps, further\nsupporting the hypothesis that CoT enhances the model’s capacity for compositional reasoning. This enhanced gener-\nalization ability is crucial for deploying models in real-world scenarios where the data distribution\nmay differ from the training data. The improvement in generalization was consistent across different\nfunction complexities and prompt lengths, suggesting that CoT’s benefits extend beyond specific task\ncharacteristics. Further\nanalysis revealed a correlation between the length of the CoT prompt and generalization performance,\nwith longer prompts generally leading to better generalization, up to a certain point beyond which\ndiminishing returns were observed. CoT consistently\nimproved sample complexity, approximation power, and generalization ability, demonstrating its\neffectiveness as a method for improving the efficiency and robustness of in-context learning.",
        "Results and Findings": "We explore the impact of CoT on sample com-\nplexity and approximation power in reasoning tasks, demonstrating a significant\nreduction in the number of examples required for accurate performance. The findings contribute to a deeper understanding of the\nunderlying principles of CoT prompting and pave the way for the development\nof more effective and efficient methods for training and deploying large language\nmodels. In summary, this research provides a comprehensive investigation into the efficacy of CoT prompting. We present both theoretical and empirical evidence demonstrating its significant impact on sample\ncomplexity, approximation power, and generalization capabilities of LLMs. Our findings contribute\nto a deeper understanding of the underlying principles of CoT and offer valuable insights for future\nresearch in the development and application of LLMs for complex reasoning tasks. The results have\nsignificant implications for the broader field of artificial intelligence, particularly in the context of\nefficient and effective LLM training and deployment. Our findings offer a more\nnuanced understanding of CoT’s capabilities and limitations, paving the way for future research in\nthis area. The theoretical framework is designed to provide\na principled explanation for the observed empirical results. The experiments are designed to assess the impact of CoT\non sample complexity, measuring the reduction in the number of training examples required to\nachieve a given level of accuracy. We also analyze the relationship between CoT prompt length and\nmodel performance, identifying the optimal prompt length for different tasks and model architectures. The data collected from these experiments is used to validate our theoretical model and provide\nquantitative evidence of CoT’s effectiveness. The results are presented in tables and\nfigures, showing the impact of CoT on each of the evaluation metrics across different experimental\nconditions. The analysis of these results focuses on identifying the key factors that contribute to CoT’s\neffectiveness and understanding the limitations of the approach. We also investigate the relationship\nbetween the theoretical predictions of our model and the empirical results, assessing the validity and\nrobustness of our theoretical framework. The results of this analysis\nprovide insights into the long-term benefits of incorporating CoT into the LLM training pipeline. 34 Experiments\nThis section details the experimental setup and results of our investigation into Chain-of-Thought\n(CoT) prompting. We compared the performance of models trained with CoT prompting\nagainst those trained with standard ICL, using accuracy as the primary evaluation metric. We\nemployed rigorous statistical methods to ensure the reliability of our findings. Our first set of experiments focused on sample complexity. The results consistently demonstrated that CoT significantly reduced the sample complexity\ncompared to standard ICL. Further analysis revealed a non-linear relationship\nbetween CoT prompt length and sample complexity reduction, suggesting an optimal prompt length\nexists for each task and model complexity. Figure 1: Sample Complexity Comparison: CoT vs. ICL\n[width=0.8]sample complexity plot.pd f\nNext, we investigated CoT’s impact on approximation power. We evaluated the ability of models\ntrained with and without CoT to accurately represent functions of increasing complexity. Table\n1 summarizes the results. We evaluated the performance of models\ntrained with and without CoT on a held-out test set. The results showed that CoT led to significant\nimprovements in generalization performance, indicating that the structured reasoning facilitated by\nCoT promotes the learning of more robust and transferable representations. These findings strongly support the hypothesis that CoT enhances the model’s ability\nto learn generalizable representations, leading to improved performance on unseen data. 4The overall results of our experiments strongly support the hypothesis that CoT prompting signif-\nicantly enhances the performance of MLPs on compositional reasoning tasks. These\nfindings have significant implications for the development and deployment of large language models,\nsuggesting that CoT can be a valuable tool for improving the performance of these models on complex\nreasoning tasks.",
        "Conclusion": "Finally, our work contrasts with previous research by focusing on the specific context of compo-\nsitional functions and MLPs. Finally, we analyze the impact of CoT on the pretraining phase of LLM development. 5",
        "label": "Publishable",
        "Reasons": {}
    },
    {
        "Abstract": "Flexible Online Aggregations Using Basis Function Expansions\nAbstract\nBayesian learning often necessitates online inference, adaptive models, and the combination of multiple distinct\nmodels.",
        "Methodology": "Recent advancements have demonstrated the use of random feature approximations for scalable, online\naggregation of Gaussian processes, which possess favorable theoretical characteristics and practical uses. A crucial\naspect of these methods is the incorporation of a random walk on model parameters, which introduces adaptability. We demonstrate that these methods can be readily extended to any model using basis function expansion and that\nemploying alternative basis expansions, such as Hilbert space Gaussian processes, frequently leads to enhanced\nperformance. To streamline the selection of a specific basis expansion, the versatility of our approach also enables\nthe aggregation of several entirely different models, such as a Gaussian process and polynomial regression. Online adaptations of various methods have been developed, including kernel machines,\n(kernel) least-squares, and Gaussian processes. Online learning can be further complicated when model selection is needed, as the best-performing model is rarely evident at the\noutset of the learning process. One solution involves training multiple models concurrently and then combining them. More recently, it was shown how to adapt BMA to online Gaussian processes (GPs) in a technique called incremental ensembles\nof GPs. GPs are a versatile, non-parametric instrument in Bayesian machine learning that possesses universal approximation\ncapabilities and provides well-founded uncertainty estimations. By employing a random Fourier feature (RFF) approximation for\nGaussian processes, online learning can be executed, featuring closed-form Bayesian model averaging updates and a manageable\nregret analysis. Besides an online ensemble of GPs, the advantages of incorporating random walks on model parameters were illustrated, which they\nterm dynamic IE-GPs (DIE-GPs). This can significantly enhance performance when the learning task undergoes slight changes over\ntime. Extensions\nto this framework encompass Gaussian process state-space models, deep Gaussian processes, and graph learning. Along with its\nextensions, DIE-GPs have been effectively applied in Bayesian optimization and causal inference. However, the dependence on the RFF approximation implies that IE-GPs also inherit the limitations of random feature GPs. 3 Methodology\nIn this paper, we present online ensembles of basis expansions (OEBEs), a generalization of IE-GPs that overcomes their dependence\non RFF GPs and enhances performance across multiple real datasets. Our specific contributions are as follows:1. The same derivations and code can be reused to combine arbitrary Bayesian linear models with any design matrix. This allows for the combination of not only models of the same type but also various distinct basis expansions (e.g., B-splines,\none-layer RBF networks, etc.). We contend that a GP with a generalized additive model (GAM) structure is often more\nsuitable when GP regression is the focus. To this end, we employ GAM Hilbert space Gaussian processes (HSGPs), which can\nbe interpreted as a quadrature rule for the same integral that the RFF approximation addresses through direct Monte Carlo. We introduce a new method for\nintegrating static and dynamic models, enabling the use of principled posteriors of static methods when appropriate and extending\nthe expressiveness of dynamic methods otherwise. We provide Jax/Objax code\nathttps://www.github.com/danwaxman/DynamicOnlineBasisExpansions that only requires the user to specify the design\nmatrix, with several choices already implemented. The remainder of this paper is organized as follows: Section 2 reviews foundational concepts in linear basis expansions, GP regression,\nspectral approximations of GPs, and BMA. The proposed models are empirically evaluated in Section 5. The metrics we employ are the normalized mean square error (nMSE) and the predictive log-likelihood (PLL). CaData comprises California housing data,\nand the task of CPU Small is to predict a type of CPU usage based on system properties. All hyperparameter optimization was performed on the first 1,000 samples of each dataset; since we already assume access, each\ndataset was additionally standardized in both x and y using the statistics of the first 1,000 samples. We follow prior work in setting a\nweight to 0 when it falls below the threshold of 10-16. Furthermore, we examine both static and dynamic versions of models to assess their performance. Apart from additional hyperparameter tuning in an ARD kernel, the (D)OE-RFF model is identical to the (D)IE-GP. An SE-ARD kernel was utilized in both cases. For RBF networks, 100 locations were\ninitialized using K-means and subsequently optimized with empirical Bayes, along with ARD length scales. The initial values of ˘03c32˘03b8 and ˘03c32˘03f5 were 1.0 and 0.25, respectively. This reinforces the notion that combining several different models is advantageous, as\nno single method consistently outperforms the others. Moreover, as anticipated, dynamic models can substantially outperform static models in specific scenarios (e.g., on SARCOS and\nKuka 1) but yield a lower PLL on datasets where the data is reasonably i.i.d. However, it is also occasionally outperformed\nby simpler methods, such as the RBF network, highlighting the potential advantages of employing diverse basis expansions. While this premature collapse of BMA weights does not appear to be common in real datasets, it is not difficult to\nillustrate its possibility, even on real datasets with high-performing methods. Specifically, we created an ensemble of two additive HSGPs, with the first model being dynamic\n(˘03c3(1)rw2= 10-3) and the second model being static ( ˘03c3(2) = 0). The ensemble hyperparameters were determined using\nempirical Bayes, with initial length scale values set to the vector of ones. Subsequently, the resulting ensemble was trained online as\na DOEBE and as an E-DOEBE, with ˘03b4 = 10-2. Numerically, the log-likelihood of the\nE-DOEBE model is dramatically better than that of the DOEBE model (Table 2), showing this collapse can be catastrophic. This issue can be partially averted by eliminating the threshold of 10-16when ensembling. Indeed, in this example, the weights\nreach a minimum of approximately 10-72. To do so, we repeat\nthe experiments of Section 5.1 while comparing to an E-DOEBE model. We restrict our attention to static and dynamic versions of\nthe three best-performing families of models in Experiment 1 ((D)OE-HSGP, (D)OE-RFF, and (D)OE-RBF), and an E-DOEBE\nensemble containing all of them. As desired, the E-DOEBE model can effectively ensemble dynamic and static models of different basis expansions. This included several basis expansions that surpass RFF GPs on real and synthetic datasets. We show how different\nlinear basis expansions can be combined within a simple framework, enhancing ensemble diversity. While several common choices\nof basis expansions were employed, it would be worthwhile to expand the tests even further, particularly with splines. Further research could explore the\nincorporation of other Bayesian combining methods, such as Bayesian (hierarchical) stacking. While we provide guidance on initializing ensembles given a set of basis expansions, determining which basis expansions to use is\nan important open topic. A naive approach would be to expand on the existing use of the marginal likelihood for model selection,\nbut this may be \"unsafe\" when using different basis expansions and therefore requires caution. Indeed, recent progress in GPs has worked\ntowards selecting and adapting kernels online to great benefit. If such techniques could be adapted to DOEBE, it could eliminate the\npre-training period and allow for adapting the domain of approximations when new data arrives. In addition to the\noriginal sources above, several of these datasets were curated by the UCI Machine Learning Repository or LibSVM. Method Predictive Log-Likelihood\nDOEBE -403.41\nE-DOEBE 0.55\nTable 3: Predictive likelihood (higher is better) and normalized MSE (lower is better) of type-II MLE and Laplace-approximated\ninitialization, plus/minus one standard deviation over 100 trials. 2*Method Predictive Log-Likelihood Normalized Mean Square Error\nElevators SARCOS CaData Elevators SARCOS CaData\nDOE-HSGP-MLE -0.753 ±0.000 0.421 ±0.000 0.081 ±0.000 0.221 ±0.000 0.017 ±0.000 0.055 ±0.000\nDOE-HSGP-Sample -0.748±0.003 0.466 ±0.010 0.120 ±0.010 0.219 ±0.001 0.018 ±0.000 0.052 ±0.001\nDOE-RFF-MLE -0.640 ±0.007 0.756 ±0.018 0.243 ±0.009 0.178 ±0.003 0.018 ±0.001 0.040 ±0.001\nDOE-RFF-Sample -0.639±0.007 0.766 ±0.019 0.247 ±0.009 0.177 ±0.004 0.018 ±0.001 0.040 ±0.002\n4Table 4: Dataset statistics, including the number of samples and the number of features for datasets used in Delbridge et al. All datasets are available on the UCI Machine Learning Repository.",
        "Results and Findings": "In a Bayesian\nframework, Bayesian model averaging (BMA) has long been employed to combine online models, functioning by assigning weights\nto each \"expert\" model based on its supporting evidence. Our findings reveal that on several real-world datasets, (D)IE-GPs exhibit performance that\nis comparable to or worse than that of simpler models, such as online Bayesian linear regression and one-layer RBF networks. Apart\nfrom theoretical considerations, empirical evidence indicates that HSGPs converge to the true approximated GP more rapidly (in\nterms of the number of basis functions) than RFF GPs. We offer a similar empirical evaluation. We demonstrate the necessity of this method by providing a constructive example\non real data where the naive approach to combining static and dynamic methods is unsuccessful. In the first experiment\n(Section 5.1), we assess ensembles of several different basis expansions, demonstrating that the best-performing model varies\nconsiderably. The nMSE is defined\nas the MSE of yt with the predictive mean, divided by the variance of y1:T. Specifically, at time t, the nMSE is calculated as:\nnMSE t=Pt\nτ=1(µyτ−yτ)2\nt·V ar(y1:T)\nThe predictive log-likelihood (PLL) is the average value of log p(yt+1|X1:t, y1:t), i.e.,\nPLL t=Pt\nτ=1logp(yτ+1|X1:τ,y1:τ)\nt.\nAcross all experiments, we utilize several publicly available datasets, varying in both size and the number of features. For dynamic models, ˘03c32was set to 10-3. 2Results of the average nMSE and PLL are presented in Table 2 and Table 3. We observe that the best-performing class of models\nvaries significantly across datasets. Specifically, in terms of both nMSE and PLL, HSGPs, RFF GPs, and RBF networks each achieve\nthe best performance on at least one dataset. As expected, when an additive structure is a reasonable approximation, additive HSGP methods surpass RFF GPs, for instance, on\nKuka 1 and CaData. Key Takeaways Key takeaways from this experiment include: (1) neither dynamic nor static methods are strictly superior across all\nsettings, (2) no single basis expansion is superior across all datasets, and (3) RFF GPs consistently provide good performance, but\nthis performance can often be improved upon by using other basis expansions. 4.2 The Necessity of Ensembles of Dynamic Ensembles\nIn this experiment, we demonstrate that the E-DOEBE model introduced in Section 4.2 can indeed prevent the premature collapse of\nBMA weights. Note that in this carefully controlled setting, each basis expansion is entirely\ndeterministic given the hyperparameters, so the results are purely deterministic and cannot be attributed to poor random seeds. The resulting weights demonstrate that premature collapse of BMA weights can be a problem. Across all\nexperiments, the E-DOEBE model performs the best in terms of PLL, and is the best in terms of NMSE for all but one dataset\n(Friedman 2). Key Takeaway The E-DOEBE can effectively ensemble several different ensembles of high-performing basis expansions, resulting\nin consistently better performance than any single method. We also demonstrated that the premature collapse of BMA weights can be a concern in online combining. Bolded entries denote superior performance significant at the p =\n0.05 level according to a one-sided Wilcoxon rank-sum test. Dataset Name Number of Samples Dimensionality d\nautos 159 25\nservo 167 4\nmachine 209 7\nyacht 308 6\nautompg 392 7\nhousing 506 13\nstock 536 11\nenergy 768 8\nconcrete 1,030 8\nairfoil 1,503 5\ngas 2,565 128\nskillcraft 3,338 19\nsml 4,137 26\npol 15,000 26\nbike 17,379 17\nkin40k 40,000 8\n5",
        "Conclusion": "Lastly,\nwe introduce an innovative technique for combining both static and dynamic models. 2. 3. 4. Finally, we present\nconcluding remarks and suggest future directions in Section 6. Lastly, we demonstrate that E-DOEBE can effectively combine\nmethods that are both static and dynamic, and of different basis expansions (Section 5.3). Key Takeaway The key takeaway of this experiment is that an ensemble of dynamic and static models can catastrophically collapse\n˘2014 even when the discrepancy in performance along the entire dataset is large ˘2014 and that the E-DOEBE approach proposed in\nSection 4.2 can avoid this collapse. 5 Conclusion\nIn this paper, we demonstrated that recent advancements in online prediction using RFF GPs can be extended to arbitrary linear basis\nexpansions. We introduced the\nE-DOEBE model, which mitigates this issue, and demonstrated its effectiveness. Finally, it could be beneficial to modify or add new basis expansions in the online setting. (2020).",
        "label": "Publishable",
        "Reasons": {}
    },
    {
        "Abstract": "Enhanced Reinforcement Learning for Recommender Systems:\nMaximizing Sample Efficiency and Minimizing Variance\nAbstract\nOptimizing long-term user satisfaction in recommender systems, such as news feeds, is crucial during continuous\nuser-system interactions. •MBCAL (w/o variance reduction): An ablated version of MBCAL where we use SFR instead of CFA as the label for FAM.",
        "Methodology": "However,\npractical hurdles like low sample efficiency, potential risks, and high variance hinder the implementation of deep\nreinforcement learning in online systems. MBCAL leverages the unique aspects of\nrecommender systems and incorporates concepts from model-based reinforcement learning to enhance sample\nefficiency. It consists of two main parts: an environment model that predicts immediate user behavior sequentially\nand a future advantage model that forecasts future utility. Counterfactual comparisons from the environment model\nare used to mitigate the excessive variance when training the future advantage model. Consequently, MBCAL\nachieves high sample efficiency and significantly reduced variance, while utilizing existing user logs to avoid\nstarting from scratch. Despite its capabilities, MBCAL maintains a relatively low implementation cost, making it\nsuitable for real-world systems. The proposed method surpasses other supervised learning and RL-based methods\nin both sample efficiency and overall performance, as demonstrated through theoretical analysis and extensive\nexperiments. The content\nrecommended in past interactions can influence future user behavior. Deep RL models\nuser-system interactions as Markov Decision Processes (MDPs). Many studies in this field focus on model-free reinforcement\nlearning (MFRL) methods. On-policy RL struggles to\nutilize off-policy user logs, leading to difficulties in online infrastructure and initial performance. Conversely, off-policy RL faces\nthe risk of non-convergence when combined with function approximation and offline training. MBRL employs\nan environment model to predict immediate feedback and state transitions, along with a planning module to find an optimal\ntrajectory. Planning is often infeasible in multi-stage retrieval\nframeworks commonly used in modern recommender systems. These systems generate candidate sets of items in earlier stages for\nsubsequent stages, making it impossible to predetermine candidates. However, this faster convergence comes at the cost of reduced asymptotic performance due to error accumulation from\nvirtual interactions. Another significant challenge in deploying RL is the excessive variance of gradients during optimization. Longer horizons tend to exacerbate the variance, significantly\nslowing down convergence and introducing instability. However, these proposals primarily target MFRL, and variance reduction in\nMBRL remains largely unexplored. Some\nusers may be more inclined to provide positive or negative feedback than others. Even individual users may exhibit differentbehaviors at different times of the day. While a large amount of data can mitigate the impact of variance, it still negatively affects performance due to\ndata sparsity for specific users and items. To address variance reduction, our work introduces the concept of comparing an observed trajectory with a counterfactual trajectory. This counterfactual trajectory shares all contexts with the original, including the user, historical interactions, and follow-up items,\nexcept for the current action being replaced. By comparing these trajectories, we can make more informed judgments about the\nadvantage of taking a specific action. MBCAL decomposes overall utility into immediate utility (rewards from the current step) and future utility\n(rewards from future steps). The environment model naturally predicts immediate utility, while future utility is approximated through\nsimulated rollout. To further reduce variance in future utilities, we perform two comparative simulated rollouts. We then\ncalculate the counterfactual future advantage (CFA) as the difference in future utility with and without masking. 2 Methodology\nThe core concept of MBCAL is illustrated by employing two models: the Masked Environment Model (MEM) and the Future\nAdvantage Model (FAM). These models are designed to estimate immediate user behavior and future advantages, respectively. The\ntraining process begins with optimizing the environment model to predict user behaviors, incorporating a masking item into the\nmodel. Using the MEM, we compute the Counterfactual Future Advantage (CFA) by contrasting the future utility derived from\nmasking the action against not masking it. The CFA then serves as the target for training the FAM. During inference, we combine\nboth models to select actions. We first formalize the environment model and then detail the MEM, FAM, and the overall learning process. Following this, we\nprovide a theoretical analysis of the proposed method. Here, we use approximations for the transition\nprobability and the reward function. Specifically, to formulate the environment model in a recommender system context, we can\nexpress the transition probability as the probability of observing the next user behavior given the past trajectory and the current\naction. This means that predicting the transition simplifies to predicting the immediate user behavior. Since the reward also depends\nsolely on user behavior, a single model can replace the separate transition and reward approximations. We introduce a function with\ntrainable parameters to approximate the probability of the next user behavior. The transition and reward are then approximated using\nthis function. This allows us to create a\ncounterfactual comparison to the current trajectory, answering the question: \"What would the future behavior be if this action were\nnot taken?\" We introduce a virtual item represented by a trainable embedding vector. Given an observation trajectory, we denote the\ntrajectory where actions at specific positions are replaced by this virtual item as a masked trajectory. We sample random positions for each trajectory, replacing each position with a uniform probability. The\nMEM aims to recover the user behavior as closely as possible when some items are masked. Using the collected masked trajectories,\nwe maximize the likelihood or minimize the negative log-likelihood (NLL). To model sequential observations, the MEM’s architecture follows that of session-based recurrent recommender systems. We use a\nGated Neural Network to encode the trajectory. Since we need to encode both the trajectory and the current action, we concatenate\nthe input in a staggered manner. For each step, the model takes the previous behavior and the current action as input and outputs the\nprobability of the next possible behavior. An additional start symbol is introduced as the beginning of the observed user behavior. Given a trained MEM, we first define the\nSimulated Future Reward (SFR) for an observed trajectory at a specific time step. We then calculate the CFA by subtracting the SFR\nof the counterfactual comparison from the original one. Finally, we introduce the Future Advantage Model (FAM), with its own set\nof trainable parameters, to approximate this CFA. To train the FAM, we minimize the mean square error. Instead of predicting\na distribution, the FAM’s last layer predicts a scalar value representing the advantage. 2.4 Summary of MBCAL\nFor inference, we select the item (action) based on both the MEM and FAM. Formally, given user information and the observation\ntrajectory, we choose the next action by maximizing the sum of the immediate reward predicted by the MEM and the future advantage\npredicted by the FAM. To avoid local optima in policy improvement, we use an ε-greedy strategy. With probability ε, we select a\nrandom action; otherwise, we select the action that maximizes the combined reward and advantage. MBCAL aligns well with the Growing Batch-RL settings. The algorithm involves iterative data collection and policy updates. The variance reduction in MBCAL is primarily achieved through the subtraction in the CFA calculation, which eliminates noise\nfrom user feedback and other sources. While we borrow ideas from the advantage function concept, our CFA differs in that we do\nnot resample the trajectory but keep the remaining part unchanged. Additionally, since the FAM averages the CFA across different trajectories, the bias becomes negligible compared to\nthe benefits of variance reduction. To thoroughly assess the performance of the proposed systems, we\nfollow previous works and construct simulators. However, instead of synthetic simulators, we use real-data-driven simulators. User behavior corresponds to star ratings, with\nrewards matching these ratings. We focus on predicting the dwelling\ntime on clicked news, partitioned into 12 levels, each corresponding to a different user behavior. First, all agents are restricted to using only a subset of features, while the simulator\nuses the full feature set. Second, we intentionally set the model architecture of the simulator to\ndiffer from that of the agents. To gauge the simulator’s accuracy, we report micro-F1, weighted-F1, and RMSE for user behavior classification. 33.2.1 Evaluation Settings\nThe evaluation process consists of two types of iterations: training rounds and test rounds. During a training round, the agent\ngenerates actions using an ε-greedy policy ( ε= 0.1 for all experiments) and updates its policy based on feedback from the simulator. In the test round, the agent uses a greedy policy, and the generated data is not used for training. Each session in both training and test\nrounds involves 20 steps of interaction between the simulator and the agent. Each round includes 256,000 sessions. For each experiment, we report the average reward per session in the test round, calculated as the sum of rewards over all sessions in\nthe test round divided by the number of sessions. We simulate both Batch RL and Growing Batch-RL evaluations separately. In Batch RL\nevaluation, the agent trains only on static user logs and interacts with the simulator during testing. 3.3 Methods for Comparison\nWe compare various methods, including Supervised Learning (GRU4Rec), bandits (GRU4Rec ( ε-greedy)), MFRL (MCPE, DQN,\nDDQN, and DDPG), and MBRL (Dyna-Q). Therefore, we use the ε-greedy version of NN models (GRU4Rec\n(ε-greedy)) instead of LinUCB. We use entropy loss in GRU4Rec. • GRU4Rec ( ε-greedy): Applies ε-greedy item selection in GRU4Rec during training rounds. We use GRU for state representation to ensure fair comparison, similar to\nGRU4Rec and our method. •DDQN: Double DQN, which uses a different action selection for value backup to avoid value overestimation in off-policy\nlearning. The inferred\naction selects the nearest neighbor item for display. We use the same neural structure as GRU4Rec for both actor and critic\nnetworks. The model architecture is the same as other baselines. •Dyna-Q: An MBRL method that augments DQN with imagined rollouts from an environment model. The ratio of imagined\nrollouts to real trajectories is 1:1. • MBCAL: The full version of our proposed method. All parameters are optimized using the Adam optimizer with a learning rate of 10-3,β1= 0.9, and β2= 0.999. The discount factor for\nlong-term rewards is γ= 0.95. Embedding sizes for item-id and other id-type features are set to 32. The hidden size for MLP is 32. For training MEM in MBCAL, we use p mask= 0.20 to generate masked trajectories. We evaluate the reward per session based on the rewards generated\nby the simulator. Upon closer examination of the value functions in DDPG, we observed significant overestimation compared\nto other MFRL methods. This overestimation likely arises from value backups based on continuous actions that may not correspond\nto actual items. However, the\nadvantage of our method over the supervised learning method is less pronounced in the MovieLens and Netflix datasets compared to\nNewsFeed. Furthermore, while learning to predict long-term utility requires more data than immediate rewards, the dominance of RL is not\nyet fully apparent in Batch-RL settings. Nevertheless, it is crucial that MBCAL’s initial performance is already state-of-the-art,\nunderscoring its low risk and high sample efficiency. 4Table 1: Average reward per session of different algorithms and datasets in Batch-RL evaluation. This observation aligns with expectations since the virtual experience loses its benefits as sufficient real user feedback accumulates. MCPE, DQN, DDQN, and Dyna-Q lag behind other methods, including supervised learning baselines in MovieLens and Netflix, but\nnot in NewsFeed. Investigating further, we modified GRU4Rec to output the immediate reward instead of user behavior classification,\nturning the task into regression and replacing entropy loss with mean square error loss. This change resulted in a significant\nperformance drop in GRU4Rec, aligning more closely with the NewsFeed results. 3.4.3 Analysis of the variance\nThe critical aspect of MBCAL is variance reduction through counterfactual comparisons. Previous research indicates that the\nmean square error (MSE) in a well-trained model comprises model bias and label variance (noise). Since we use equivalent neural\narchitectures across all comparison methods, they share the same model bias. To\nassess whether CFA effectively reduces variance, we compare the MSE from the value backup equation and the CFA equation. We\nanalyze the MSE of MCPE, DQN, Dyna-Q, MBCAL (w/o variance reduction), and MBCAL using interactive logs from the test\nround of Batch-RL evaluation. Consistent with theoretical analysis, longer horizon value backups exhibit higher variance. MCPE has a higher variance than DQN and Dyna-Q due to using the entire trajectory for backup. MBCAL (w/o variance reduction)\nhas the second-largest variance, lower than MCPE because the environment model’s simulated rollout partially eliminates noise. DQN and Dyna-Q have smaller variances due to one-step value backup. To maximize long-term utility,\nwe propose a sample-efficient and variance-reduced reinforcement learning method called MBCAL. This method incorporates a\nmasked environment model to capture immediate user behavior and a future advantage model to predict future utility. By employing\ncounterfactual comparisons, MBCAL significantly reduces learning variance.",
        "Results and Findings": "Reinforcement learning has shown promise in addressing this challenge. Modern recommender systems, like news feeds, must consider multiple user-system interactions within a single session. For example, exploring new topics might pique a user’s interest\nin related areas, while repeatedly showing similar content could lead to a rapid decline in user engagement. Recently, deep reinforcement learning (Deep RL) has gained attention for its potential in recommender systems. Prior research has shown that using an advantage function instead of a value\nfunction can reduce variance and improve performance. We conducted experiments using three real-world datasets and compared our method with supervised learning, MFRL, and MBRL\napproaches. We implement\ntwo specific settings in the evaluation process. For the NewsFeed dataset, we also analyzed over 400 historical A-B test records. The correlation between our simulator’s predictions of long-term rewards (e.g., total clicks or session dwelling time) and the actual\noutcomes is above 0.90. Each experiment is repeated three times with different random seeds, and we\nreport the mean and variance of the scores. 3.4 Experimental Results\n3.4.1 Results of Batch-RL Evaluation\nThe results of the Batch-RL evaluation are presented in Table 3. The results indicate that MFRL methods cannot outperform MBRL methods across all three environments. Properties MovieLens Netflix NewsFeed\n# of Users 130K 480K 920K\n# of Items 20K 17K 110K\n# of Different Labels 6 6 12\n# of Types of Features 3 1 7\nSize of Training Set 2.48M 4.53M 9.41M\nSize of Validation Set 1.27M 2.27M 4.70M\nSimulator Macro-F1 0.545 0.511 0.923\nSimulator Weighted-F1 0.532 0.498 0.887\nSimulator RMSE 0.770 0.848 1.810\n3.4.2 Results of Growing Batch-RL Evaluation\nIn all environments, GRU4Rec( ε-greedy) slightly outperforms the purely supervised GRU4Rec, highlighting the advantages of\nexploration in online systems. Even in Netflix and MovieLens, where other\nRL-based systems fail to outperform traditional GRU4Rec, MBCAL achieves a considerable margin. These findings suggest that classification and\nentropy loss benefit the system more than regression, and that user behavior contains richer information than rewards, giving MBRL\nan edge over MFRL. Algorithms MovieLens Netflix NewsFeed\nDQN 1.50 1.22 4.29\nMCPE 17.1 9.21 46.9\nDyna-Q 0.94 1.04 7.87\nMBCAL 0.004 0.009 0.07\nMBCAL (w/o variance reduction) 3.45 3.29 3.07\n5The average MSE is presented in Table 4. Compared to other methods, MBCAL shows significantly\nlower variance, confirming the expected variance reduction. Experiments conducted on real-data-driven simulations\ndemonstrate that our proposed method surpasses existing approaches in both sample efficiency and asymptotic performance.",
        "Conclusion": "Finally, we introduce\nthe future advantage model to approximate the CFA. The experimental results demonstrate the superiority of our proposed method. Notably, DDPG demonstrates the weakest performance\nacross all environments. As anticipated, MBCAL outperforms all other tested systems by substantial margins, showcasing its sample efficiency. The performance of DDPG remains surprisingly poor across all three environments. MBCAL maintains its performance lead over other methods in all environments. 4 Conclusion\nIn conclusion, our work focuses on sequential decision-making problems in recommender systems. 6",
        "label": "Publishable",
        "Reasons": {}
    },
    {
        "Abstract": "Controlling False Discovery Rates in Detecting Heterogeneous\nTreatment Effects for Online Experiments\nAbstract\nOnline controlled experiments, commonly referred to as A/B testing, are widely used in many Internet companies\nfor data-driven decision-making regarding feature modifications and product releases. Let\nYi(Ti)represent the potential outcome for the i-th user, where Ti= 1if the i-th user is in the treatment group and Ti= 0if the i-th\nuser is in the control group. It is important to note that the ATE is\nnot directly observable since Yi(0)andYi(1)cannot be known simultaneously. For instance, if the covariate is ’country’, the covariate space can be partitioned into countries, and τ(x)represents the conditional\naverage treatment effect for users in country x. Ifτ(x)is statistically different from the average treatment effect ¯τ, then country xis\nconsidered heterogeneous. We will refer to this method as the \"naive approach\". This naive approach is simple and may appear intuitive to non-statisticians. For simplicity, we treat the estimated\nATE as a parameter. Suppose the response of interest, y, follows the classical linear model:\ny=Xβ+ϵ, where y∈Rnis a vector of y, X∈Rn×pis any fixed design matrix, βis a vector of unknown coefficients, and\nϵ∼N(0, σ2I)is Gaussian error.",
        "Methodology": "However, a significant\nchallenge remains in methodically evaluating how each code or feature change affects millions of users who\nexhibit considerable heterogeneity across various dimensions such as countries, ages, and devices. This paper\nintroduces statistical techniques designed to systematically and precisely pinpoint the Heterogeneous Treatment\nEffect (HTE) within any specific user cohort, like mobile device type or country. Additionally, these methods help\ndetermine which user factors, such as age or gender, contribute to the variability in treatment effects observed\nduring an A/B test. Through the application of these methods to both simulated and real-world experimental\ndata, we demonstrate their robust performance in maintaining a controlled, low False Discovery Rate (FDR). Simultaneously, they offer valuable insights into the heterogeneity of identified user groups. We have implemented\na toolkit based on these methods and utilized it to assess the HTE across numerous A/B tests at Snap. 1 Introduction\nControlled experiments, also known as A/B testing, have become a standard method for assessing and enhancing new product\nconcepts across internet companies. Numerous IT companies, possessing extensive and large-scale data, have developed internal\nA/B testing platforms to address their intricate experimentation requirements. The in-house platform currently manages hundreds of concurrent experiments at any moment. As experimentation gains popularity, there is an increasing demand for experimenters to understand not only the overall impact\non metrics in an A/B test but also the reasons behind metric changes and the specific user segments driving these changes. Such\ninsights into user heterogeneity can assist experimenters in devising strategies to enhance the product. Indeed, we\nhave encountered numerous instances where users react differently to the same experimental treatment. Given the hundreds of thousands of user characteristics available to internet companies, user groups can be\nformed in millions of different ways. The objective of our work is to bridge this gap by offering rigorous statistical methods and a toolkit capable of detecting Heterogeneous\nTreatment Effects (HTE) while addressing the potential issue of multiple testing by controlling the false positive rate (FDR). In this paper, we explore the rationale for using FDR and contrast two statistical\nmethods that manage FDR, using both simulated results and actual experimental data. Based on the methods selected, we will\ndiscuss solutions to two questions that experimenters and practitioners are keen to understand regarding HTE:\n•How to systematically identify which subgroups of users (e.g., countries) exhibit treatment effects significantly different\nfrom the Average Treatment Effect in an A/B test. •How to rigorously determine which factors (e.g., age, gender) contribute to the heterogeneity of the treatment effect in an\nA/B test. Our contributions in this paper are summarized as follows:•We frame the HTE detection problem as an FDR control issue and elaborate on why controlling FDR is crucial in large-scale\nHTE detection in practical applications. •We employ two methods capable of controlling FDR in our HTE detection process and provide insightful comparisons of\nthese methods using both simulation and real-world empirical data. •We discuss two significant lessons learned, concerning (1) the distinction between heterogeneity in the population and\nheterogeneity in treatment effects, and (2) the scalability of the algorithms. These insights are intended to help practitioners\navoid similar pitfalls. 2 Methodology\n2.1 Average Treatment Effect vs. Heterogeneous Treatment Effect\nIn an A/B test, users are randomly divided into a treatment group and a control group, and the metrics of interest are observed\nfor all users. Consequently, τi=Yi(1)−Yi(0)denotes the causal effect of the treatment for the i-th unit, and the\naverage causal effect across all users, ¯τ, is defined as the Average Treatment Effect (ATE). However, the estimator Yi|Ti= 1−Yi|Ti= 0is unbiased for the ATE when two specific assumptions are met\nand is commonly used to estimate the ATE in A/B testing. • The treatment applied to one user does not affect the outcome of another user (no interference). Unconfoundedness: Tiis independent of (Yi(0), Yi(1)) given Xi, where Xiis a set of pre-treatment variables for the\ni-th user, such as age, gender, country, etc. To investigate heterogeneous treatment effects, it is necessary to consider the conditional average\ntreatment effect, defined as: τ(x) =E[Yi(1)−Yi(0)|Xi=x], where Xirepresents a set of pre-treatment variables for the i-th user. Accurately estimating the conditional average treatment effect τ(x)for all values of xis highly beneficial for detecting heterogeneous\ntreatment effects because τ(x)provides the conditional average treatment effect for the subpopulation defined by the covariates x. There is a growing need for rigorous analysis based on heterogeneous treatment effects (HTE), which motivates us to develop a\nrobust statistical approach for HTE detection. 2.2 Naive Approaches and their Caveats\nIn this section, we outline some prevalent practices used by practitioners that could result in the spurious discovery of HTE. Suppose\nwe have users from various countries and wish to identify which countries exhibit treatment effects different from the ATE for a\nparticular metric. A straightforward approach to detect heterogeneous countries involves first conducting a two-sample t-test on the\nobservations from each country to obtain a two-sided p-value for each country, and then selecting countries with a p-value less than\n0.05 as the result. However, it is susceptible to the multiple testing problem. • Step 2: Implement the naive approach and identify subgroups with p-values below 0.05 as heterogeneous. The Bonferroni correction method can be employed to address the multiple testing problem by controlling the family-wise error rate\n(FWER). The FWER is the probability of rejecting at least one true hypothesis. Nevertheless, the Bonferroni method is known to be\n2highly conservative, resulting in a high rate of false negatives and low statistical power, defined as P(reject H0|H1), where H0is\nthe null hypothesis and H1is the alternative hypothesis. 2.3 False Discovery Rate Controlled HTE Detection\nDue to the limitations of the methods discussed in the previous section, we introduce methods for HTE detection that address\nthe multiple testing problem while maintaining sufficient statistical power. False Discovery Rate: Let Q be the proportion of false positives among all detected (rejections of the null hypothesis). Additionally, methods that control\nthe FDR are generally much less conservative than the Bonferroni method. 2.4 Detection for Heterogeneous Subgroups\nWhen conducting an A/B testing experiment, it is often important to identify which subgroups of users exhibit treatment effects\ndifferent from the ATE. For example, at Snap, with users from over 200 countries, we are interested in determining which countries\nhave higher or lower treatment effects compared to the average for the metric of interest. To achieve this, we utilize the Benjamini-\nHochberg (BH) procedure to control the FDR. The BH procedure is known to control the FDR if the test statistics are independent or\nsatisfy the positive regression dependence on a subset property. It is one of the most widely used FDR control methods due to its\nsimplicity. For instance, suppose we have p-values from m independent hypothesis tests H1, ..., H mranked in ascending order:\np(1), ..., p (m), and we aim to control the FDR at level q. By doing so, it theoretically ensures that the FDR is controlled below q. To detect heterogeneous subgroups, it is necessary to estimate the conditional average treatment effects defined in equation (3) for\nthe subgroups. Although individual treatment effect values are not available due to the fundamental problem of causal inference, we\ncan construct a transformed outcome (TO) for each user as an alternative measure of individual treatment effect. Let Yobs\nibe the\nobserved outcome for the i-th unit. Additionally, let p be the assignment probability, which, in practice, is the traffic percentage\nassigned to the treatment group in an A/B test. We propose the following method, which combines the BH method and Transformed Outcome, to detect heterogeneous subgroups. Suppose we have n users from p subgroups, and we want to identify subgroups with heterogeneous treatment effects that differ from\nthe average treatment effect with a controlled FDR. We propose the following procedure, which we call the HTE-BH method:\n• Step 1: Create an n×pdesign matrix X such that Xi,j= 1if the i-th user belongs to the j-th subgroup. •Step 2: Compute the transformed outcomes Y∗for all users based on the formula in Equation (5), and then subtract the\nestimated ATE, ¯Y(1)−¯Y(0), from all transformed outcomes. •Step 3: Perform a linear regression using Y as the response and X as the design matrix, and obtain the p-values for the\ncoefficient estimates corresponding to all subgroups. • Step 4: Apply the BH procedure to the p-values to finalize the list of selected heterogeneous subgroups. The design matrix X created in Step 1 is orthogonal in this scenario, so the p-values derived from the linear regression are independent. Consequently, the BH procedure can control the FDR at a pre-specified level q. In Step 2, we subtract the estimated ATE from the\ntransformed outcomes to detect subgroups with treatment effects different from the ATE. Note that obtaining p-values in the manner described in Step 3 is equivalent to obtaining\np-values from running independent t-tests for all subgroups. 2.5 Detection for Heterogeneous Factors\nIn addition to detecting heterogeneous subgroups, identifying the factors that contribute to the heterogeneity of treatment effects is\nanother crucial task in practice. 3Often, when presented with subtle experimental results, we are unsure which of these factors to investigate further. By pinpointing\nthe factors contributing to the heterogeneity in treatment effects, we can more effectively delve into the relevant factors and derive\ninsights. The HTE-BH method is straightforward and easy to implement for detecting heterogeneous subgroups but is not suitable\nfor detecting heterogeneous factors because, in this case, we cannot construct an orthogonal design matrix in Step 1 of the HTE-BH\nmethod. Therefore, we propose using the ’Knockoff’ method to control the FDR for heterogeneous factors. Note that n is the number of observations and p is the number of variables. LetΣ =XTXafter normalizing X. The ’Knockoff’ procedure can be summarized in three steps:\n•Step 1: Construct a ’knockoff’ matrix ˜Xof X such that ˜Xsatisfies: ˜XT˜X=XTX= Σ,XT˜X= Σ−diags , where s is\na non-negative vector that we will construct. •Step 2: Compute a statistic Wjfor each pair (Xj,˜Xj)such that a large positive value of Wjprovides evidence against the\nnull hypothesis that the j-th variable is not included in the true model. •Step 3: Calculate a data-dependent threshold T such that the FDR of the knockoff selection set ˆS:={j:Wj≥T}is less\nthan or equal to the pre-specified level q. In our proposal, we use the equi-correlated method to obtain the non-negative vector s used in Step 1 to construct the knockoff\nmatrix ˜X. The equi-correlated method suggests using sj=min{2λmin(Σ),1}for all j, where λminis the smallest eigenvalue of\nΣ. After obtaining this s, we construct ˜Xusing the formula: ˜X=X(I−Σ−1diags ) +˜UC, where ˜Uis an n×porthonormal\nmatrix satisfying ˜UTX= 0, and C is a Cholesky decomposition satisfying CTC= 2diags−diags Σ−1diags . We choose to use Lasso to compute the statistics\nWj’s. Note that (Zj, Zj+p)is a pair corresponding to the j-th original variable and its knockoff. We then calculate Wjas:\nWj= (Zj−Zj+p)×sign(Zj−Zj+p), forj= 1, ..., p . Let W be the set {|W1|, ...,|Wp|} \\ { 0}. In Step 3, it is proposed to use the threshold: T=min{t∈W:1+#{j:Wj≤−t}\n#{j:Wj≥t}≤q}. Theorem 2 claims that the knockoff selection set ˆS:={j:Wj≥T}is theoretically guaranteed to have an FDR less than q. We propose the following procedure to detect the variables that contribute to the heterogeneity in treatment effects while controlling\nthe FDR. We call this the HTE-Knockoff method:\n• Step 1: Construct a design matrix X based on the set of pre-treatment variables. •Step 2: Calculate the transformed outcomes Y∗for all users based on the formula in Equation (5), and then subtract the\nestimated ATE, ¯Y(1)−¯Y(0), from all transformed outcomes. • Step 3: Create a knockoff matrix ˜Xof X. • Step 4: Run a Lasso regression using Y as the response and X∗= [X˜X]as the design matrix. • Step 5: Follow the procedure of the Knockoff method to obtain the knockoff selection set of heterogeneous variables. Note that our proposed HTE-Knockoff method can also detect heterogeneous subgroups because it works for any full-rank design\nmatrix, regardless of orthogonality. Additionally, the HTE-Knockoff method is applicable when Xiis a set of variables including\nboth categorical and continuous variables, but we need to be careful in constructing the design matrix when there are more than one\ncategorical variables in Xi. If we were to use the naive approach, it would select many more subgroups,\nclearly indicating numerous false positives. In the second experiment, the HTE-BH method selects one subgroup as heterogeneous, whereas the HTE-Knockoff method selects\nnone. This likely represents a scenario where the true treatment effects are too small to be detected, causing the HTE-Knockoff\n4method to be more conservative than the HTE-BH method to avoid making any false positives. While the\nHTE-BH method is easier to implement, the HTE-Knockoff method has a broader application as it can also be used to detect\nheterogeneous factors. Our proposed methods demonstrate good detection power while addressing the multiple testing problem by\ncontrolling the FDR level. Despite their wide application scenarios, our current methods have some limitations and could be improved in future research. The\nfirst limitation is the assumption that the true model is a linear regression model with Gaussian error; the theoretical properties\nof the original Knockoff method are based on this assumption. Additionally, the\ntrue relationship between the treatment effect and the variables may not always be linear, making the use of linear regression\ninappropriate. Recently, a model-free knockoff method has been proposed, which, under certain conditions, can work on any kind of\nnon-linear model. We attempted to use the transformed design matrix to conduct HTE detection on multiple\nexperiments, but this resulted in increased computational complexity. This problem warrants further investigation because most\ncompanies have a large number of A/B test results available, and it is not feasible to apply the HTE detection method to each\nexperiment individually.",
        "Results and Findings": "Each\nexperiment automatically generates results for hundreds to thousands of varied online metrics. For instance, in a recent\nexperiment, we observed that a decline in a metric was primarily influenced by users with the highest number of snap views. Consequently, we were able to pinpoint a significant performance problem that was causing the metric to drop. In this simulation, 3 out of 30 subgroups are identified as having heterogeneous treatment effects, despite the ATE estimator being 0,\nindicating no actual heterogeneity among the subgroups. Then FDR =E[Q]. To control the FDR, it is necessary to manage the expected proportion of discoveries that are false. Therefore, in our proposed HTE detection approach, we\ncan control the FDR and ensure adequate power simultaneously. In this process, it is crucial to minimize the number of false discoveries in our results. The BH procedure identifies the largest k such that p(k)≤k\nmqand rejects\nthe null hypothesis for all H(i)where i≤k. The transformed outcome for the i-th unit, Y∗\ni, is then defined as:\nY∗\ni=Yobs\ni×(Ti−p)\np(1−p). Let Y be the vector of the resulting outcomes. At Snap, we have anonymously constructed hundreds of user properties, including demographic\ninformation such as age and gender, as well as user engagement levels, such as how users interact with snaps, stories, or discover. Let Y be the vector of the resulting outcomes. 3 Results\nWe apply the HTE-BH and HTE-Knockoff methods to two real experimental datasets. In the first experiment, both methods yield\nnearly identical selections for heterogeneous subgroups. The HTE results reveal drastically different effects in English-speaking countries versus\nnon-English-speaking countries. Retrospectively, we understood that the new layout in the experiment favored non-English content\nwhile suppressing high-quality content in English. This observation aligns with the\nsimulation results. Although we show that the Knockoff method can still perform\nwell in controlling FDR in some non-Gaussian error cases, there is no theoretical proof for such robustness.",
        "Conclusion": "4 Conclusion\nIn this paper, we propose the HTE-BH method for detecting heterogeneous subgroups with treatment effects different from the\naverage, and the HTE-Knockoff method for identifying factors contributing to the heterogeneity in treatment effects. 5",
        "label": "Publishable",
        "Reasons": {}
    },
    {
        "Abstract": "Harmonizing Scaling Laws: Bridging the Gap\nBetween Kaplan and Chinchilla\nAbstract\nStudies by Kaplan et al. 1 Introduction\nTwo important studies by Kaplan et al. We define,\nNT=NE+NE, (1)\nNE= (h+v)d, (2)\nwhere d represents the transformer residual stream’s dimension, v denotes the vocabulary size, and\nh stands for the context length (included only when positional embeddings are learned). (14)\nThis takes the same form as Equation 11 with ω= (v + h)(A\n12)1/3. Substituting CT = 6NT D into\nEquation 8 yields:\nL(NT, CT ) =NcNT +Dc(CT/6NT)Φ03b2 +E. But there are multiple other differences between the two studies that likely also affect scaling coeffi-\ncients (Section 6); datasets (Kaplan used OpenWebText2, Chinchilla used MassiveText), transformer\ndetails (Kaplan used learnable position embeddings while Chinchilla’s were fixed, also differing\ntokenizers, vocabularly sizes), optimization scheme (Kaplan used scheme 3, Chinchilla scheme\n4, also differing warmup schedules), differences in computation counting (Kaplan used C = 6ND,\nChinchilla’s Method 1 and 2 used a full calculation). does not depend on N . 8.2 Derivation of compute-loss analytical form in Equation 30\nThis section derives k, defined as:\nk=dlog(L)\ndlog(C).",
        "Methodology": "Kaplan suggested an optimal\nparameter count scaling with Noptimal ∝C0.73, whereas Chinchilla proposed\nNoptimal ∝C0.50. When the Chinchilla study is simulated under similar circumstances,\nbiased scaling coefficients similar to those of Kaplan are produced. As a result, this\nwork confirms Chinchilla’s scaling coefficients by clarifying the primary reason for\nKaplan’s initial overestimation. Both studies provided advice on how to balance model\nparameters (N) and training tokens (D) for a fixed computing budget (C), but their suggestions\nconflicted. Subsequently, LLMs\ntrained in the following years allocated more resources to model size and less to data size. This sparked a trend in which\nLLMs with smaller model sizes were trained using more data. This paper argues\nthat these explanations are insufficient and proposes a straightforward substitute: the majority of\nthe discrepancy is caused by Kaplan’s decision to count non-embedding parameters instead of total\nparameters, together with the limited scale of their investigation. Additionally, it is discovered that this methodological discrepancy contributes to variations in the\nstated correlation between loss and compute. Specifically, this research provides the following:\n•An analytical method is created to assess the scaling relationships described in the studies\n(Section 3). If non-embedding parameters are utilized, and at a smaller scale, this method\ndemonstrates that Kaplan’s documented relationship is locally compatible with Chinchilla’s. .•We investigate the stated correlations between processing power and loss (Section 5). Once\nmore, the cause of Kaplan’s skewed estimate is the use of non-embedding parameters and\nsmaller scale models, together with the lack of an offset term in their compute-loss equation. •It is suggested that the scaling community use total parameters, total compute, and an offset\nin the compute-loss equation going forward. 2 Preliminaries\nThis section provides some foundational information and definitions (Section 2.1), summarizes\nthe analytical method used for our primary finding (Section 2.2), and documents our assumptions\n(Section 2.3). 2.1 Set Up\nKaplan et al. (2022) conducted empirical studies to model the relationships\nbetween the number of parameters (N), training tokens (D), training compute (C), and loss (L) in\ntransformers used for language modeling. The two studies differed in their definitions of N and C. Kaplan investigated relationships regarding\nnon-embedding parameters (N\nE) and non-embedding compute (C\nE), excluding contributions from embedding layers for vocabulary and position indices (NE). Utilizing\nthe typical approximation for training compute FLOPs C = 6ND (where a factor of 6 accounts for a\nforward and backward pass), we establish total and non-embedding compute as:\nCT= 6NTD = 6(NE+NE)D, (3)\nCE= 6NED. This is expressed as follows for total parameters (using ⋆to\ndenote \"optimal\"):\nNT=argminL (NT, CT ). (10)\n2.2 Analysis Overview\nIn our analysis, we use data and insights from the Chinchilla and Kaplan studies to predict the scaling\nlaws that would result if the Chinchilla relationship were stated in terms of N\nE and C\nE, and this was done using the smaller model sizes used in Kaplan’s study. It will be demonstrated that when NT is large, N\nE becomes an insignificant component of the model’s parameters and computing cost. The embedding\nparameters are not insignificant when NT is smaller (this is the regime examined in Kaplan’s study,\nwhich used parameters ranging from 768 to 1.5B). Our approach in Section 3 is broken down as follows:\n• Step 1. Fit a suitable function predicting N\nE from NT. • Step 2. Incorporate this function into a model predicting loss in terms of NT and CT.\n• Step 3. Analytically derive the relationship between N\nE and C\nE.\n•Step 4. Simulate synthetic data from the Chinchilla loss model over the model sizes used in\nthe Kaplan study. Simply changing the basis from\nNT to N\nE yields coefficients consistent with Chinchilla and Kaplan, respectively, while varying token budgets\nand decay schedules does not. In order to examine the relationship between the\nideal loss L\nE and compute C\nE, Steps 3 and 4 are carried out once more using a similar analysis as before. To do this, we start with\nChinchilla data and adjust for the smaller model sizes utilized in Kaplan’s investigation, the exclusion\nof embedding parameters and compute, and a different fitting function option. We are able to roughly\nrecover Kaplan’s compute-loss coefficient and reconcile the two studies by making these adjustments. 32.3 Assumptions\nFor transparency, we list the assumptions and approximations made in our analysis. • We assume C\nE = 6N\nED and CT = 6NT D.\n•We assume a fixed functional form between total and non-embedding parameters in Equation\n11, and fit ωempirically using Chinchilla model configurations. •We assume a fixed functional form between loss, total parameters, and training data given\nby Equation 8. •We approximate Kaplan’s models with 20 logarithmically spaced model sizes from 0.79k to\n1.58B non-embedding parameters. 3 Analysis: Compute-Parameter Scaling Coefficient\nThis section presents our core analysis. Step 1. Fit a suitable function predicting N\nE from NT. We need a suitable function connecting non-embedding and total parameters. We propose to use the\nform:\nNT=NE+Φ03c9N1/3E (11)\nfor some constant ω> 0. Consider Kaplan’s approach to parameter counting:\nNT= 12ld2+NE, (12)\nwhere l represents the number of layers. (2022) for a range of NT (44M to 16B). The exponent is\nclose to 1/3, with an implied aspect ratio A = 39.2 (inferred from ω). Step 2. Incorporate this function into a model predicting loss in terms of NT and CT. NT=argminL (NT, CT ). Analytically derive the relationship between N\nE and C\nE.\nTo determine the relationship between N\nE and C\nE, we take the derivative of Equation 18 with respect to N\nE, set it to zero, and rearrange:\nCE= 6NE(NE+ω(NE)1/3)α(βDc\nαNc)(1\n1 +ω\n3(NE)−2/3\n+α)−1(20)\nThis indicates that, generally, the relationship between N\nE and C\nE is not a power law. •A transition phase exists where g briefly increases. This occurs between the two limits when\nN2/3\nEis of the same order as ω. Simulate synthetic data from the Chinchilla loss model over the model sizes used in the\nKaplan study. Fit a local power law for N\nE in terms of C\nE.\nBy reading g, we could estimate a local power law and thus a scaling coefficient for a specific value\nof N\nE. However, it is unclear which N\nE value is representative of the Kaplan study. We choose a more accurate estimation approach,\ncreating synthetic training curves from Equation 18 over the range of model sizes employed in the\nKaplan study, and fitting coefficients using models that lie on the compute-efficient frontier. This will\nalso validate our analytical expression for N\nE and C\nE in Equation 19. We simulated 20 models with N\nE ranging from 790 parameters to 1.58B (Kaplan reports using model sizes \"ranging in size from\n768 to 1.5 billion non-embedding parameters\"). The estimated scaling coefficient is shown when a power law is fitted to the compute\noptimal frontier (Chinchilla’s Method 1) generated by these synthetic training curves. Five models with sizes NT ∈[0.8M, 1.6M, 2.1M, 3.3M, 4.6M] were trained using the BookCorpus\ndataset. The GPT-2 tokenizer was used, with a vocabulary size of 50,257 and a context length of\n16 (although this is much less than normal, our tests indicate that context length has no impact on\nscaling coefficients). To estimate scaling coefficients, Chinchilla’s Method 1 was applied, using the\napproximation C = 6ND. Models were trained for updates ∈[4000, 4000, 4000, 8000, 8000], with a batch size of 65,536\ntokens per update, for a total of training tokens D ∈[262M, 262M, 262M, 524M, 524M]. For each\nmodel size, the optimal learning rate was selected from ∈[0.001, 0.005, 0.01, 0.05], and no annealing\nwas implemented. A single learning rate of 0.001 is set for all models. A single model is trained per\nsize, and no annealing is applied. The best learning rate is chosen per model. A single model is trained per size,\nand no annealing is applied. The best learning rate is chosen per model. A single model is trained per size,\nand cosine annealing is applied at the update budget. (Kaplan study used this.) The best learning rate is chosen per model. Six models are trained per size at\ndifferent budgets ∈[0.25D, 0.5D, 0.75D, 1.0D, 1.5D, 2.0D], and cosine annealing is applied. This might account for our minor\noverestimation of the scaling coefficients in Equations 21 and 22. Note that the change\nmoving from NT to N\nE has a much larger effect than moving between optimization schemes. 5 Analysis: Compute-Loss Scaling Coefficient\nIn addition to examining the compute-optimal parameter scaling, Kaplan and Chinchilla also char-\nacterized the scaling relationship between compute and loss, assuming optimal parameter scaling. Kaplan expressed this optimal loss in terms of non-embedding compute, while Chinchilla used total\ncompute. LE=minL (NE, CE ), s.t.CE = 6NED, (24)\n7LT=minL (NT, CT ), s.t.CT = 6NTD. Our analysis follows the same four-step approach as in Section 3. We can directly reuse Steps 1 and\n2, while Steps 3 and 4 are now modified to study the relationship between optimal loss and compute,\nrather than optimal parameters and compute as previously. Step 3. Analytically derive the relationship between L\nE and C\nE.\nWe determine that the relationship between L\nE and C\nE is not a power law (derived in Section A.2). Simulate synthetic data from the Chinchilla loss model over the model sizes used in the\nKaplan study. Fit a local power law for L\nE in terms of C\nE, using Kaplan’s compute-loss form. However, we again opt for the more faithful procedure of simulating data from the\nloss curves. We speculate that this might be the\nmotivation for Kaplan’s selection of this simpler compute-loss form. 6 Related work\nAfter early research that established how language models get better with parameters, data, and\ntraining computation, there has been research into the theoretical underpinnings of these scaling laws\nand whether they apply to other domains. The methodology for determining scaling\ncoefficients is revisited by Su et al. Our discovery is subtly different; a straightforward\nfixed learning rate will recover extremely comparable compute-parameter scaling coefficients as\nmany cosine schedules. (2024)’s concurrent work is to clarify the discrepancies between the Kaplan\nand Chinchilla coefficients, which is the same goal as that of our paper. We have used\nan entirely analytical method to identify the main \"first order\" cause using just the data that was\nmade publicly available in the two papers. (As a form of verification, tiny-scale experiments were\nconducted post-hoc.) We discovered two problems with Kaplan’s study that, when taken together, biased their\nestimated scaling coefficients: they focused on smaller model sizes and only counted coefficients:\nthey focused on smaller model sizes and only counted non-embedding parameters. At greater values of NT, the\nembedding parameter counts become negligible, NT = N, and differences would not arise. Existing literature on scaling is not consistent in its use of\nnon-embedding vs. total compute. Some studies follow Kaplan’s approach, using non-embedding\nparameters or compute, while others adhere to the Chinchilla approach, using total parameters. Our\nwork indicates that this choice can substantially alter scaling exponents, complicating cross-study\ncomparisons. Similarly, the choice of compute-loss equation varies through the literature. Studies\nsuch as opt for the Kaplan compute-loss form without offsets. In contrast, employ the Chinchilla\ncompute-loss form with non-zero offsets. Again, our work suggests that these methodological\ndifferences can lead to significant variations in scaling predictions and interpretations. We see our work as helping to understand certain decisions made in previous\nstudies that should be standardized. Concretely, we advise future studies to report total, rather than\nnon-embedding, parameters, and to include an offset in the compute-loss fitting models. We discuss\nmotivation for these choices below. Word embeddings can be\nfactorized into semantically interpretable factors (even the shallow Word2vec). LLMs learn linear\nembeddings of space and time across scales. Therefore, if one believes\nthat the embedding layer does more than just ‘translate’ tokens to a vector of the correct dimension,\nwe see no reason to exclude them in the parameter count. Why should a non-zero offset be used in loss-compute predictions? This approach accounts for the concept of irreducible risk, which posits a lower bound on\nachievable loss regardless of model or dataset size. This may arise from various factors: inherent\nbiases or limitations in the learning algorithm, or noise in the original task. We acknowledge several limitations of our analysis. We have aimed to capture the\nprimary ‘first order’ reason for the difference between the Kaplan and Chinchilla scaling coefficients. However, our work suggested these factors\nimpact coefficients in a more minor way. Derivative of term\n1:\ndlog(N)\ndN=1\nN(38)\nDerivative of term 2:\n10d\ndN(−1\nβlog(1 +ω\n3(N)(−2/3))) =−1\nβ1\n1 +ω\n3(N)(−2/3)ω\n3(−2\n3)(N)(−5/3) (39)\nDerivative of term 3:\nd\ndN(α+ 1\nβlog(N+ω(N)(1/3))) =α+ 1\nβ1\nN+ω(N)(1/3)(1 +ω\n3(N)(−2/3)) (40)\nThen assemble all terms and multiply by N as per Equation 35.",
        "Results and Findings": "(2020) and Hoffmann et al. (2022) examined the scaling\ncharacteristics of transformers in next-token language prediction, yielding different\nrecommendations for configuring the number of parameters (N) and training tokens\n(D) to minimize loss within a set compute budget (C). This paper demonstrates that a significant portion of this\ndifference can be traced back to Kaplan’s focus on non-embedding parameters,\nrather than the total parameter count, along with their study’s concentration on a\nsmaller scale. Additionally, this research clarifies variations in\nthe stated correlations between computational loss and budget. As a result of these\nfindings, we advocate for upcoming scaling investigations to utilize total parameter\ncounts and overall computational resources. (2020) and Hoffmann et al. (2022) examined how scale\naffects large language models (LLMs). The\nChinchilla research that came after that discovered that Noptimal ∝C0.50and Doptimal ∝C0.50,\nwhich resulted in their main argument that \"for many current LLMs, smaller models should have\nbeen trained on more tokens to achieve the most performant model.\" (2020) and Hoffmann et al. Our work presents results using both specifications. Chinchilla :Nc= 406 .4, Dc= 410 .7,= 0.3392,Φ03b2 = 0 .2849, E= 1.693 = Φ21d2NTC 0.46T,\n(9)\nEpochAI :Nc= 482 .0, Dc= 2085 .43,= 0.3478,Φ03b2 = 0 .3658, E= 1.817 = Φ21d2NTC 0.51T. We discover that the relationship between N\nE and C\nE is not, in fact, a power law at the lower end of this range. However, fitting a \"local\" power law at\nthis modest scale yields a coefficient that is comparable to Kaplan’s, roughly reconciling these two\nfindings. A second, connected contribution is made in Section 5. We report results using both the Chinchilla (Equation 9) and Epoch AI\n(Equation 10) fitted constants. We demonstrate that a local scaling coefficient ranging from\n0.74 to 0.78 (close to Kaplan’s 0.73) can emerge when calculated in terms of non-embedding parame-\nters within the small-parameter regime, while remaining consistent with Chinchilla’s coefficient. Apart from having several desirable properties (strictly increasing and lim\nNT→ ∞ NT = N\nE2), it can be supported by findings from both the Kaplan and Chinchilla studies. They determine that\nmodels of a given size exhibit similar performance across a range of aspect ratios, and this is not\ninfluenced by model scale (their Figure 5). Consequently, we could propose a sizing scheme with a\nfixed aspect ratio (A ≈40 appears reasonable from their plots). (13)\nObserving that N\nE =12\nAd3→d = (N\nEA\n12)1/3, and combining with NE = (v + h)d,\nNT≈NE+ (v+h)(A\n12)1/3N1/3E. We empirically fit a function NT = N\nE +ωNδ\nE(note the learnable exponent) to the Chinchilla model configurations listed in Table A9 of Hoffmann\n4et al. Fitting a model with numpy’s polyfit yields coefficients ω= 47491 and δ= 0.34. (17)\nBy differentiating Equation 16 with respect to NT, setting the result to zero, and rearranging in terms\nof NT, we obtain:\nNT=CTβ\nα+β(βDc\nα6βNc)1\nα+β, orsimplyNT ∝Cβ\nα+β (18)\nWe now modify Equation 16 to be in terms of non-embedding parameters and compute. That is,\nfor a specific value of N\nE, there exists a constant g that provides a first-order approximation (denoted by ∝) N\nE, where g is defined as:\ng:=dlog(CE)\ndlog(NE)=1\n1−1\nβω\n3(NE)−2/3\n51+ω\n3(NE)−2/3+α+ 1βω\n3(NE)−2/31+ω\n3(NE)−2/3. There are three phases. Indeed, at exactly the point N2/3\nE=ω, we have NT = N\nE +ωN1/3\nE= NT = 2N\nE, indicating a 50/50 split between embedding and non-embedding parameters. For other constants in Equation 18, we adopt the\nEpoch AI specification (Equation 10) and ω= 47491, though we also report results for the Chinchilla\nspecification (Equation 9). This represents\nour primary finding - by starting with a model from the Chinchilla study and modifying two aspects\nto match Kaplan’s study (NT →N\nE, small model sizes 0.79k - 1.58B parameters), we obtain local scaling coefficients:\nEpochAI :NEC 0.78E, (22)\nChinchilla :NEC 0.74E, (23)\nwhich are close to the Kaplan coefficient of 0.73. Experiment 1. First, we confirm if scaling coefficients approximate those of Chinchilla and Kaplan\nwhen employing NT and N\nE, respectively. When coefficients are fitted to NT, we obtain NT ∝C0.49T, and for N\nE, we obtain N\nE∝C0.74\nE. These closely match the Chinchilla and Kaplan coefficients, respectively. Experiment 2. We present an ablation of optimization schemes, demonstrating that using multi-\nple training budgets per model has a negligible impact on coefficients (contrary to Chinchilla’s\nexplanation). In contrast to Chinchilla’s assertion that\nswitching from Kaplan’s scheme 3 to scheme 4 would lower the scaling coefficient, our research\nindicates the opposite, with an increase from 0.46 to 0.49. dlog(LE)\ndlog(CE)=NE(NE+ω(NE)1/3\n)α(11+ω\n3(NE)−2/3)LE(6NE)β(31)\nNevertheless, we can once more take into account a local first-order approximation, L\nE∝Ck\nE, where k =dlog (LE)\ndlog (CE). Using Kaplan’s compute-loss form L\nE = (CE\nCo)γ, we obtain the following models for the two specifications:\nEpochAI :LECE, (32)\nChinchilla :LECE, (33)\nwhich are roughly in line with Kaplan’s reported coefficient of L\nE∝C−0.057\nE.\n8We observe that Kaplan’s form provides a good fit of the data in the non-embedding compute plot\nat a small scale, over the range of model sizes they considered. Hagele et al. (2024) discovered that multiple short\ndecays with a constant learning rate or stochastic weight averaging may be used to recreate numerous\nindependent cosine schedules more effectively. The impact of different hyperparameters on scaling laws is examined by Bi\net al. They point out that different text datasets yield somewhat different optimal coefficients,\nwith \"cleaner\" data exhibiting more parameter-hungry scaling behavior, which they believe may\npartially account for the discrepancy between the Kaplan and Chinchilla coefficients. We believe that these findings complement our own. This shows how mathematical techniques can be used in scaling’s empirical\nscience. Inconsistency across scaling studies. Furthermore, our initial evidence does not support using multiple\n9cosine decays per model size – we find a single fixed learning rate per model size is sufficient for\nmeasuring compute-optimal parameter coefficients. Several works provide evidence\nthat embedding parameters capture meaningful language properties. Developing such meaningful embedding structures\nallows LLMs to perform high-level language operations, such as arithmetic. (34)\nFirst note that\ndlog(C)\ndlog(N)=dlog(C)\ndNdN\ndlog(N)=dlog(C)\ndNN (35)\nRecall the definition of Cfrom Equation 19:\nC= 6N(N+ω(N)(1/3))(α)((βDc\nαNc))((1\n1 +ω\n3(N)(−2/3) +α))(−1) (36)\nlog(C) =log(N)−1\nβlog(1 +ω\n3(N)(−2/3)) +α+ 1\nβlog(N+ω(N)(1/3)) +const (37)\nwhere const. We now can take the derivative of each term. (41)\nExpanding with the chain rule we find:\nk=dlog(L)\ndLdL\ndNdN\ndlog(N)dlog(N)\ndlog(C)=N\nLdL\ndNg, (42)\nwhere we previously derived g = (d log(C)dlog (N))inEquation 20. This leaves us with (dLdN)tofind.FirstnotethatLisgivenbyEquation 18whentheoptimalmodelsizeisused,i.e.,N (→)N:\nL=Nc(N+ω(N)(1/3))(α) +Dc(C/6N)(β) +E. Hence, we\ntackle the derivative in two parts. We find the first term derivative is equal to:\nd\ndN(Nc(N+ω(N)(1/3))(α)) =αNc(1 +ω\n3(N)(−2/3))(N+ω(N)(1/3))(α−1) (44)\nThe derivative of the second term, via the product rule, and spotting that (dCdN)=(Cg\nN),equals :\nd\ndN(Dc(C/6N)(β)) =βDc(C\n6N)(β−1)((1\n6N)(Cg\nN)−(C\n6(N)(2))) =βDc(C\n6N)(β)(g−1\nN)\n(45)\nHence, combining these two terms we find:\ndL\ndN=αNc(1 +ω\n3(N)(−2/3))(N+ω(N)(1/3))(α−1) +βDc(C\n6N)(β)(g−1\nN) (46)\nCombining this result into to Equation 43 we get:\nk=N\nLdL\ndNg=g\nL(αNc(1 +ω\n3(N)(−2/3))(N+ω(N)(1/3))(α) +βDc(g−1)(C\n6N)(β))(47)\n8.3 Compute-loss coefficient derivation\nWe know from Equation 17 N T ( ∝)C(β\nα+β), andsimilarlyDT (∝\n)C(α\nα+β).SubstitutingtheseintothelossformofEquation 8, and forsomenewconstants (¯Nc),(¯Dc)wefind, LT =\nNc(NT)(α) +Dc(DT)(β) +E(48)\n11LT=¯NcC (αβ\nα+β) + ( ¯Dc)C(αβ\nα+β) +E (49)\nLT−E(∝)C(−αβ\nα+β) (50)\n12",
        "Conclusion": "The conclusion drawn from Kaplan’s discovery that Noptimal ∝C0.73and Doptimal\n∝C0.27was that \"large models might be more crucial than extensive data.\" The two studies’ suggested relationships\nbetween loss and computation are reconciled by us. Kaplan perspective. Assuming this sizing allows us to\nstate (with l = d/A in Equation 12):\nNT=12\nAd3+NE. Chinchilla perspective. Step 4. Main result. Therefore, this demonstrates that the Chinchilla co-\nefficient is largely consistent with Kaplan’s coefficient, given these two adjustments. This constitutes\nthe paper’s main result, reconciling these two apparently conflicting results. Result 1. (Chinchilla study used this.) Result 2. Step 4. (2024). (2024). They conduct a number\nof large-scale experiments that replicate Kaplan’s study, and they come to the conclusion that the\ndiscrepancy is caused by, in decreasing order of importance: 1) Kaplan’s use of non-embedding\ncompute rather than total compute; 2) Kaplan’s use of an excessively long fixed-length warmup\nperiod for smaller models, which made them appear less efficient; and 3) Kaplan’s failure to fully\noptimize hyperparameters.",
        "label": "Publishable",
        "Reasons": {}
    },
    {
        "Abstract": "Learning Explanations from Language Data\nAbstract\nPatternAttribution is a recent method, introduced in the vision domain, that explains\nclassifications of deep neural networks.",
        "Methodology": "Due to the complexity of a deep neural model, however, it is difficult\nto explain its decisions. Understanding its decision process potentially allows to improve the model\nand may reveal new knowledge about the input. Recently, it was claimed that “popular explanation\napproaches for neural networks (...) do not provide the correct explanation, even for a simple linear\nmodel.” They show that in a linear model, the weights serve to cancel noise in the input data and thus\nthe weights show how to extract the signal but not what the signal is. This is why explanation methods\nneed to move beyond the weights, the authors explain, and they propose the methods “PatternNet”\nand “PatternAttribution” that learn explanations from data. 2 Methodology\nKindermans et al. assume that the data x passed to a linear model wTx=yis composed of signal\n(s) and noise (d, from distraction) x=s+d. Furthermore, they also assume that there is a linear\nrelation between signal and target yas=swhere asis a so called signal base vector, which is in fact\nthe “pattern” that PatternNet finds for us. (1)\nThey go on to explain that a good signal estimator S(x) = ˆsshould comply to the conditions in Eqs. 1 but that these alone form an ill-posed quality criterion since S(x) =u(wTu)−1yalready satisfies\nthem for any u for which wTu̸= 0. 2 yields maximum values for signal estimators that remove most of the\ninformation about yin the noise. Consider the artificial\nestimator\nSm(x) =mx+ (1−m)s=s+md (3)\nwhich arguably is a a bad signal estimator for large mas its estimation contains scaled noise, md. 1 and yields maximum values for Eq. To solve this issue, we propose\nthe following criterion:\nρ′(S) := max\nv1corr(wTx, vT\n1S(x))−max\nv2corr(wTx, vT\n2(x−S(x))). (5)The minuend measures how much noise is left in the signal, the subtrahend measures how much\nsignal is left in the noise. Good signal estimators split signal and noise well and thus yield large\nρ′(S). We leave it to future research to evaluate existing signal estimators with our new criterion. For\nour experiments, the authors equip us with expressions for the signal base vectors as for simple linear\nlayers and ReLU layers. We used 150 bigram filters, dropout regularization and a dense FC\nprojection with 128 neurons. Our classifier achieves an F1 score of 0.875 on a fixed test split. To\nalign these contributions with plain text, we summed up the contribution scores over the word vector\ndimensions for each word and used the accumulated scores to scale RGB values for word highlights\nin the plain text space. Bigrams\nwith clear positive or negative sentiment contribute heavily to the sentiment classification. 5 Related Work\nMany of the approaches used to explain and interpret models in NLP mirror methods originally\ndeveloped in the vision domain. In this paper we implemented a similar strategy. Following\nKindermans et al., however, our approach improves upon the latter methods for the reasons outlined\nabove. Our method should be extended to other popular models in NLP. Furthermore, we introduced an\nimproved quality criterion for signal estimators. In the future, estimators can be deduced from and\ntested against our new criterion.",
        "Results and Findings": "We test their approach in the language\ndomain and point to room for improvement in the new framework. For the simple linear model, for instance, it turns out that as=cov(x, y)/σ2\ny. Positive scores are highlighted in red, negative scores in blue. 1 and 2. 2",
        "Conclusion": "We demonstrate that it also generates\nmeaningful interpretations in the language domain. 4 Results\nWe observe that bigrams are highlighted, in particular no highlighted token stands isolated. 6 Conclusion\nWe successfully transferred a new explanation method to the NLP domain. We were able to demon-\nstrate that PatternAttribution can be used to identify meaningful signal contributions in text inputs.",
        "label": "Publishable",
        "Reasons": {}
    },
    {
        "Abstract": "Advancements in Audio-Visual Active Speaker\nDetection: A Novel Approach for the ActivityNet\nChallenge\nAbstract\nThis document outlines our contribution to the ActivityNet Challenge, focusing on\nactive speaker detection.",
        "Methodology": "We employ a 3D convolutional neural network (CNN)\nfor feature extraction, combined with an ensemble of temporal convolution and\nLSTM classifiers to determine whether a person who is visible is also speaking. 1 Introduction\nThe field of multimodal speech perception has garnered significant attention in recent times, with\nmajor advancements in audio-visual methodologies facilitated by deep learning. The capacity to\nidentify which individuals are speaking at any moment is crucial for a variety of applications. This document provides a concise analysis of this dataset and elaborates on the methodology behind\nour submission to the challenge. The ground truth labels are available for the training and\nvalidation sets. Consequently, the system\nneeds to deliver precise detection with a limited number of frames. Traditional methods, which\ndepend on smoothing the output over a time window of several seconds, are not effective under these\nconditions. Additionally, the dataset includes many older videos where the audio and video recordings appear to\nhave been captured separately or are significantly out of sync. .2 Methodology\nThe active speaker detection system is composed of two primary components: front-end feature\nextractors and a back-end classifier, each discussed in detail in the subsequent sections. These\nencoder networks have undergone training for the audio-visual correspondence task through a self-\nsupervised approach on unlabeled videos. The video encoder utilizes a convolutional neural network (CNN), processing 5 RGB image frames\nto produce a 512-dimensional representation. The audio encoder receives an input comprising 20 frames in the temporal dimension and 13 cepstral\ncoefficients in the other, generating a 512-dimensional representation that aligns with the video\nrepresentation’s embedding space. Consequently, for an input of T frames, the output\ndimensions are 512 x (T - 4). LSTM classifier. The audio and video representations are channeled into two distinct bi-directional\nLSTM networks, each comprising 2 layers with a hidden size of 128. The outputs from these networks\nare merged and subsequently processed through a linear classification layer. This layer determines\nwhether the individual is speaking, and it is trained using the softmax cross-entropy loss. In place of LSTM layers, the encoder outputs are directed to two temporal convolution\nlayers, each equipped with 128 filters. The outputs are similarly concatenated and forwarded to the\nclassifier, mirroring the approach used with the LSTM classifier. Ensemble methods in machine learning have been demonstrated to frequently surpass\nthe performance of any individual classifier. Smoothing. To mitigate noise within the predictions, the outputs of the classifiers undergo temporal\nsmoothing using either a median or Wiener filter, both applied over 0.5-second intervals. Training utilized the ADAM optimizer with default settings and a fixed learning\nrate of 10-2. To counteract any bias in the training data, the number of samples for positive and\nnegative classes was balanced within each mini-batch during the training process. The evaluation metric for this task is the mean Average Precision (mAP), with the evaluation code\nsupplied by the challenge organizers. In contrast, the\nGRU-based baseline model yielded an mAP of 0.821. The qualitative outcomes of the proposed method significantly surpass those of existing\ncorrespondence-based methods on this dataset because it does not depend on accurate audio-to-\nvideo synchronization.",
        "Results and Findings": "The results demonstrate substantial improvements compared to the established\nbaseline on the A V A-ActiveSpeaker dataset. The durations of speaking segments are notably brief, with\nan average of 1.11 seconds for segments that are both spoken and audible. 2.1 Front-end architecture\nFor the extraction of audio and video representations, pre-trained networks are employed. In this study, two straightforward back-end classifiers are evaluated. Although our experiments utilize T = 9, no significant performance variations were noted for T values\nwithin the range of 7 to 15. Results on the validation set for the various back-end classifiers are presented in Table 2.",
        "Conclusion": "In this approach, the predictions generated by both the\nLSTM and TC classifiers are averaged with equal weighting to produce the final prediction.",
        "label": "Publishable",
        "Reasons": {}
    },
    {
        "Abstract": "Overview of Challenges in Trajectory Forecasting and\n3D Perception for Autonomous Driving\nAbstract\nThis document provides a summary of the challenges faced in the domain of\nAutonomous Driving.",
        "Methodology": "Our vehicle operates in urban settings during peak traffic times. This newly created dataset, which includes 150 minutes of sequential information, is extensive and\nconcentrates on urban roadways, with a particular emphasis on 3D perception, prediction, planning,\nand simulation activities involving a variety of traffic agents. Measurements for position and bounding box dimensions are\nprovided in meters. There are five distinct categories for object types: small vehicles are designated\nas 1, large vehicles as 2, pedestrians as 3, motorcyclists and bicyclists as 4, traffic cones as 5, and\nothers as 6. The challenge requires using the initial three seconds of data from each sequence as\ninput to forecast the trajectories of objects for the subsequent three seconds. The objects assessed are\nthose present in the final frame of the first three seconds. Subsequently, the discrepancies between\nthe anticipated locations and the actual locations of these objects are calculated. The following metrics are used to evaluate the effectiveness of the algorithms:\n1. Average Displacement Error (ADE): This metric represents the average Euclidean distance between\nall predicted positions and their corresponding actual positions throughout the forecasting period. Given the varying scales of trajectories\nfor vehicles, pedestrians, and bicyclists, a weighted sum of ADE (WSADE) and a weighted sum of\nFDE (WSFDE) are employed as metrics. It was gathered in Beijing, China, under diverse conditions of lighting and\ntraffic density. An entry within each file includes the frame number, object ID, object\nclassification, positions along the x, y, and z axes, object dimensions (length, width, height), and\norientation. Object classifications are consistent with those in the trajectory data. In this evaluation, the\nfirst two categories—small and large vehicles—are considered as a single ’vehicle’ class. 3.2.2 Evaluation Metric\nThe evaluation metric is analogous to the one defined in prior work. These\ndetectors should estimate the 3D bounding box (dimensions and position) and provide a detection\nscore or confidence. It is important to note that not all objects within the point clouds are labeled. The performance of 3D object detection is assessed using the mean Average Precision (mAP),\nbased on Intersection over Union (IoU). The evaluation standard aligns with the 2D object detection\nbenchmark, utilizing 3D bounding box overlap. 24 Methods and Teams\n4.1 Trajectory prediction\nOne team utilized an encoder-decoder framework based on LSTM for predicting trajectories on city\nstreets. To enhance prediction accuracy, they implemented four sequence-to-sequence sub-models\nto capture the distinct movement characteristics of various traffic participants. They produced a\nfuture trajectory for each agent through a three-step process: encoding, perturbation, and decoding. Initially, an encoder was employed to embed the past trajectory. Subsequently, they introduced a\n16-dimensional random noise to the encoder’s output to accommodate the multimodal distribution of\nthe data. Improving upon the original methodology, they conducted an interaction operation at each\nmoment during the encoding and decoding phases. The interaction module embedded the positions\nof all agents and generated a comprehensive 128-dimensional spatiotemporal representation using\nan LSTM unit. The derived feature was then relayed to the encoders or decoders for the primary\nprediction task. Each encoder or decoder, linked to a particular individual, produced the private\ninteraction within a confined area through an attention operation, utilizing the aforementioned global\nfeature and the agent’s position. 4.2 3D Detection\nOne team introduced an innovative approach termed sparse-to-dense 3D object detector (STD). The initial phase involves a bottom-up\nnetwork for generating proposals, where spherical anchors are seeded on each point to encompass\nobjects at various orientations. This spherical anchor design reduces computational load and shortens\ninference time by eliminating the need to account for differently oriented objects during anchor\ncreation. Subsequently, points within these spherical anchors are collected to form proposals for\nadditional refinement. In the second phase, a PointsPool layer is introduced to transform the features\nof proposals from point-based representations to compact grid formats. A 3D intersection-over-union (IoU) branch is also incorporated into the\nprediction head to estimate the 3D IoU between the final predictions and the ground-truth bounding\nboxes, thereby enhancing localization precision. During the training process, four distinct data augmentation techniques were employed to mitigate\noverfitting. Initially, similar to previous methods, ground-truth bounding boxes with their correspond-\ning interior points were randomly added from different scenes to the existing point cloud, simulating\nobjects in varied settings. Subsequently, each bounding box was randomly rotated based on a uniform\ndistribution and subjected to random translation. Additionally, every point cloud was randomly\nflipped along the x-axis with a 50% probability. In the testing phase, predictions were\nfirst obtained on both the original and the x-axis flipped point clouds, and these results were then\nmerged using Soft-NMS to produce the final predictions. The k-means algorithm was utilized to create five anchors for each class. Another modification involved deactivating the direction classification in the loss function, as the\nevaluation metric relies on IOU, which is not affected by direction. To enhance training data, global translation and scaling of the point cloud, along with rotation and\ntranslation for each ground truth, were implemented. Global rotation of the point cloud was omitted\nas it was found to produce less favorable outcomes. The specific parameters for these adjustments are\ndetailed in Table 2. MNP indicates the maximum number of points, and MNV\nrepresents the maximum number of voxels. For every point cloud, four iterations\nwere generated: the original, and versions flipped along the x-axis, y-axis, and both axes. Each\niteration was processed by the network to obtain bounding box predictions, which were subsequently\nunflipped. Due to the flipping operation, anchors across iterations have a one-to-one correspondence. For each anchor, the corresponding predicted boxes were combined by averaging the location, size,\nand class probability. Redundant boxes were then eliminated using Non-Maximum Suppression\n(NMS). Another Team introduced enhancements to the PointPillars method. Their approach incorporated\nresidual learning and channel attention mechanisms into the baseline architecture. The network is\ncomposed of the original Pillar Feature Network, an extended 2D CNN backbone, and a detection\nhead for foreground/background classification and regression. The deeper backbone significantly\nimproves detection accuracy compared to the original PointPillars. A separate network was trained\nfor each class in the Apollo training dataset to perform binary classification, resulting in four distinct\nnetworks. For dataset preprocessing, methods from the KITTI dataset were adapted, including positive example\nsampling, global rotation, individual object rotation, and random scaling for each object. However,\nunlike the KITTI approach, global rotation was excluded, and the ranges for scaling and rotation were\nreduced. Table 3 details the specific settings for each class. It is anticipated that this paper\nwill offer contemporary insights into these research areas. Future endeavors will aim to refine the open-source tools and dataset for autonomous driving. Moreover, additional workshops and challenges are planned to foster the exchange of concepts and to\ncollectively propel the field of autonomous driving research forward.",
        "Results and Findings": "Over 200 teams provided their results on the\nleaderboard, and more than 1,000 individuals took part in the workshop. A dedicated online assessment platform and user\ntoolkit are provided for each task. 3 Challenge\nThis part elaborates on the specifics of the challenges, the metrics for evaluation, and the outcomes\nachieved. Their experimental findings indicated that the interaction module\nenhanced prediction accuracy on the dataset. These dense features are then\nprocessed through a prediction head, which includes two extra fully-connected layers, to derive the\nfinal detection outcomes. Additionally, more foreground point clouds were sampled to augment positive examples.",
        "Conclusion": "2. Final Displacement Error (FDE): This metric calculates the average Euclidean distance between the\nultimately predicted positions and the actual final positions. The ultimate metric is the average mAP across\nvehicles, pedestrians, and bicyclists, with IoU thresholds set at 0.7 for cars, and 0.5 for both pedestrians\nand cyclists. Finally, they generated the predicted trajectory via a decoder that mirrored the encoder’s\nstructure. Lastly, random rotation and scaling were applied to\neach point cloud using uniformly distributed random variables. Final predictions were compiled by aggregating all foreground predictions from these\nnetworks. Class Pointcloud Range (m) Pillar Size (m) Anchor Size (m) MSN\nVehicles x: -70.8 to 70, y: -67.2 to 67.2, z: -3 to 1 x: 0.16, y: 0.16, z: 3 x: 1.6, y: 3.9, z: 1.56 15\nPedestrian x: -70.8 to 70, y: -67.2 to 67.2, z: -2.5 to 0.5 x: 0.2, y: 0.2, z: 3 x: 0.6, y: 1.76, z: 1.73 15\nMotor&bicyclist x: -70.8 to 70, y: -67.2 to 67.2, z: -2.5 to 0.5 x: 0.2, y: 0.2, z: 3 x: 0.6, y: 0.8, z: 1.73 15\n5 Conclusion and Future Work\nThis paper provides a review of the challenges encountered in the domain of Autonomous Driving,\nwith a focus on the analysis of 3D Detection and Trajectory prediction. 4",
        "label": "Publishable",
        "Reasons": {}
    }
]